Pandabear1125/tycore/src/imxrt_regmap.h
#ifndef IMXRT_REGMAP_H
#define IMXRT_REGMAP_H

// This file contains the register definitions and contents for the IMXRT1062

// The register format is as follows:
//      typedef volatile struct {
//          reg_t field1 : a;
//          reg_t field2 : b;
//          ...
//          reg_t fieldN : z;
//      } REGISTER_NAME_t;
// #define REGISTER_NAME ((REGISTER_NAME_t*)0xADDRESS)
// The define is required to keep the compiler from placing these in the DTCM and in memory in general

// References of the form RM 11.2.3 refer to the reference manual for the IMXRT1062, chapter 11, section 2, subsection 3
// Reference manual can be found in the doc folder: IMXRT1060ReferenceManual.pdf

// References of the form AM A1.2.3 refer to the ARMv7-M architecture reference manual, chapter A, subchapter 1, section 2, subsection 3
// Reference manual can be found in the doc folder: ARMv7mManual.pdf

#include <stdint.h>

typedef volatile uint32_t reg_t;

// IOMUXC Memory Map/Register Definition
// RM 11

#pragma region IOMUXC_MODULE

typedef volatile struct {
	reg_t mux_mode : 4;	 // what ALT mode this pin is set to, determines functionality
	reg_t sion	   : 1;	 // software input on/off, allows software to control input
	reg_t		   : 27;
} IOMUXC_SW_MUX_CTL_PAD_t;

// ALT mode macros for GPIO muxing
#define IOMUXC_ALT1 (0x01u)
#define IOMUXC_ALT2 (0x02u)
#define IOMUXC_ALT3 (0x03u)
#define IOMUXC_ALT4 (0x04u)
#define IOMUXC_ALT5 (0x05u)
#define IOMUXC_ALT6 (0x06u)
#define IOMUXC_ALT7 (0x07u)
#define IOMUXC_ALT8 (0x08u)

typedef volatile struct {
	reg_t sre	: 1;  // slew rate enable
	reg_t		: 2;
	reg_t dse	: 3;  // drive strength
	reg_t speed : 2;  // drive speed
	reg_t		: 3;
	reg_t ode	: 1;  // open drain enable
	reg_t pke	: 1;  // pull / keep enable
	reg_t pue	: 1;  // pull / keep select
	reg_t pus	: 2;  // pull / keep config
	reg_t hys	: 1;  // hysteresis enable
	reg_t		: 15;
} IOMUXC_SW_PAD_CTL_PAD_t;

// IOMUXC GPR Memory Map/Register Definition
// RM 11.3

#pragma region IOMUXC_GPR

typedef volatile struct {
	reg_t reserved : 32;
} IOMUXC_GPR_GPR0_t;
#define IOMUXC_GPR_GPR0         ((IOMUXC_GPR_GPR0_t*)0x400AC000u)
#define IOMUXC_GPR_GPR0_RAW     ((reg_t*)0x400AC000u)

typedef volatile struct {
	reg_t sai1_mclk1_sel	: 3;
	reg_t sai1_mclk2_sel	: 3;
	reg_t sai1_mclk3_sel	: 2;
	reg_t sai2_mclk3_sel	: 2;
	reg_t sai3_mclk4_sel	: 2;
	reg_t gint				: 1;
	reg_t enet1_clk_sel		: 1;
	reg_t enet2_clk_sel		: 1;
	reg_t					: 2;
	reg_t enet1_tx_clk_dir	: 1;
	reg_t enet2_tx_clk_dir	: 1;
	reg_t sai1_mclk_dir		: 1;
	reg_t sai2_mclk_dir		: 1;
	reg_t sai3_mclk_dir		: 1;
	reg_t exc_mon			: 1;
	reg_t enet_ipg_clk_s_en : 1;
	reg_t					: 7;
	reg_t cm7_force_hclk_en : 1;
} IOMUXC_GPR_GPR1_t;
#define IOMUXC_GPR_GPR1         ((IOMUXC_GPR_GPR1_t*)0x400AC004u)
#define IOMUXC_GPR_GPR1_RAW     ((reg_t*)0x400AC004u)

typedef volatile struct {
	reg_t axbs_l_axbxl_high_priority : 1;
	reg_t axbs_l_dma_high_priority	 : 1;
	reg_t axbs_l_force_round_robin	 : 1;
	reg_t axbs_p_m0_high_priority	 : 1;
	reg_t axbs_p_m1_high_priority	 : 1;
	reg_t axbs_p_force_round_robin	 : 1;
	reg_t canfd_filter_bypass		 : 1;
	reg_t							 : 5;
	reg_t l2_mem_en_powersaving		 : 1;
	reg_t ram_auto_clk_gating_en	 : 1;
	reg_t l2_mem_deepsleep			 : 1;
	reg_t							 : 1;
	reg_t mqs_clk_div				 : 8;
	reg_t mqs_sw_rst				 : 1;
	reg_t mqs_en					 : 1;
	reg_t mqs_oversample			 : 1;
	reg_t							 : 1;
	reg_t qtimer1_tmr_cnts_freeze	 : 1;
	reg_t qtimer2_tmr_cnts_freeze	 : 1;
	reg_t qtimer3_tmr_cnts_freeze	 : 1;
	reg_t qtimer4_tmr_cnts_freeze	 : 1;
} IOMUXC_GPR_GPR2_t;
#define IOMUXC_GPR_GPR2         ((IOMUXC_GPR_GPR2_t*)0x400AC008u)
#define IOMUXC_GPR_GPR2_RAW     ((reg_t*)0x400AC008u)

typedef volatile struct {
	reg_t ocram_ctl		  : 4;
	reg_t dcp_key_sel	  : 1;
	reg_t				  : 3;
	reg_t ocram2_ctl	  : 4;
	reg_t				  : 3;
	reg_t axbs_l_halt_req : 1;
	reg_t ocram_status	  : 4;
	reg_t				  : 4;
	reg_t ocram2_status	  : 4;
	reg_t				  : 3;
	reg_t axbs_l_halted	  : 1;
} IOMUXC_GPR_GPR3_t;
#define IOMUXC_GPR_GPR3         ((IOMUXC_GPR_GPR3_t*)0x400AC00Cu)
#define IOMUXC_GPR_GPR3_RAW     ((reg_t*)0x400AC00Cu)

typedef volatile struct {
	reg_t edma_stop_req	   : 1;
	reg_t can1_stop_req	   : 1;
	reg_t can2_stop_req	   : 1;
	reg_t trng_stop_req	   : 1;
	reg_t enet_stop_req	   : 1;
	reg_t sai1_stop_req	   : 1;
	reg_t sai2_stop_req	   : 1;
	reg_t sai3_stop_req	   : 1;
	reg_t enet2_stop_req   : 1;
	reg_t semc_stop_req	   : 1;
	reg_t pit_stop_req	   : 1;
	reg_t flexspi_stop_req : 1;
	reg_t flexio1_stop_req : 1;
	reg_t flexio2_stop_req : 1;
	reg_t flexio3_stop_req : 1;
	reg_t flexio4_stop_req : 1;
	reg_t edma_stop_ack	   : 1;
	reg_t can1_stop_ack	   : 1;
	reg_t can2_stop_ack	   : 1;
	reg_t trng_stop_ack	   : 1;
	reg_t enet_stop_ack	   : 1;
	reg_t sai1_stop_ack	   : 1;
	reg_t sai2_stop_ack	   : 1;
	reg_t sai3_stop_ack	   : 1;
	reg_t enet2_stop_ack   : 1;
	reg_t semc_stop_ack	   : 1;
	reg_t pit_stop_ack	   : 1;
	reg_t flexspi_stop_ack : 1;
	reg_t flexio1_stop_ack : 1;
	reg_t flexio2_stop_ack : 1;
	reg_t flexio3_stop_ack : 1;
	reg_t flexio4_stop_ack : 1;
} IOMUXC_GPR_GPR4_t;
#define IOMUXC_GPR_GPR4         ((IOMUXC_GPR_GPR4_t*)0x400AC010u)
#define IOMUXC_GPR_GPR4_RAW     ((reg_t*)0x400AC010u)

typedef volatile struct {
	reg_t					 : 6;
	reg_t wdog1_mask		 : 1;
	reg_t wdog2_mask		 : 1;
	reg_t					 : 15;
	reg_t gpt2_capin1_sel	 : 1;
	reg_t gpt2_capin2_sel	 : 1;
	reg_t enet_event3in_sel	 : 1;
	reg_t enet2_event3in_sel : 1;
	reg_t					 : 1;
	reg_t vref_1m_clk_gpt1	 : 1;
	reg_t vref_1m_clk_gpt2	 : 1;
	reg_t					 : 2;
} IOMUXC_GPR_GPR5_t;
#define IOMUXC_GPR_GPR5         ((IOMUXC_GPR_GPR5_t*)0x400AC014u)
#define IOMUXC_GPR_GPR5_RAW     ((reg_t*)0x400AC014u)

typedef volatile struct {
	reg_t qtimer1_trm0_input_sel : 1;
	reg_t qtimer1_trm1_input_sel : 1;
	reg_t qtimer1_trm2_input_sel : 1;
	reg_t qtimer1_trm3_input_sel : 1;
	reg_t qtimer2_trm0_input_sel : 1;
	reg_t qtimer2_trm1_input_sel : 1;
	reg_t qtimer2_trm2_input_sel : 1;
	reg_t qtimer2_trm3_input_sel : 1;
	reg_t qtimer3_trm0_input_sel : 1;
	reg_t qtimer3_trm1_input_sel : 1;
	reg_t qtimer3_trm2_input_sel : 1;
	reg_t qtimer3_trm3_input_sel : 1;
	reg_t qtimer4_trm0_input_sel : 1;
	reg_t qtimer4_trm1_input_sel : 1;
	reg_t qtimer4_trm2_input_sel : 1;
	reg_t qtimer4_trm3_input_sel : 1;
	reg_t iomuxc_xbar_dir_sel_4	 : 1;
	reg_t iomuxc_xbar_dir_sel_5	 : 1;
	reg_t iomuxc_xbar_dir_sel_6	 : 1;
	reg_t iomuxc_xbar_dir_sel_7	 : 1;
	reg_t iomuxc_xbar_dir_sel_8	 : 1;
	reg_t iomuxc_xbar_dir_sel_9	 : 1;
	reg_t iomuxc_xbar_dir_sel_10 : 1;
	reg_t iomuxc_xbar_dir_sel_11 : 1;
	reg_t iomuxc_xbar_dir_sel_12 : 1;
	reg_t iomuxc_xbar_dir_sel_13 : 1;
	reg_t iomuxc_xbar_dir_sel_14 : 1;
	reg_t iomuxc_xbar_dir_sel_15 : 1;
	reg_t iomuxc_xbar_dir_sel_16 : 1;
	reg_t iomuxc_xbar_dir_sel_17 : 1;
	reg_t iomuxc_xbar_dir_sel_18 : 1;
	reg_t iomuxc_xbar_dir_sel_19 : 1;
} IOMUXC_GPR_GPR6_t;
