Pandabear1125/tycore/src/imxrt_regmap.h
#define IOMUXC_GPR_GPR6         ((IOMUXC_GPR_GPR6_t*)0x400AC018u)
#define IOMUXC_GPR_GPR6_RAW     ((reg_t*)0x400AC018u)

typedef volatile struct {
	reg_t lpi2c1_stop_req  : 1;
	reg_t lpi2c2_stop_req  : 1;
	reg_t lpi2c3_stop_req  : 1;
	reg_t lpi2c4_stop_req  : 1;
	reg_t lpspi1_stop_req  : 1;
	reg_t lpspi2_stop_req  : 1;
	reg_t lpspi3_stop_req  : 1;
	reg_t lpspi4_stop_req  : 1;
	reg_t lpuart1_stop_req : 1;
	reg_t lpuart2_stop_req : 1;
	reg_t lpuart3_stop_req : 1;
	reg_t lpuart4_stop_req : 1;
	reg_t lpuart5_stop_req : 1;
	reg_t lpuart6_stop_req : 1;
	reg_t lpuart7_stop_req : 1;
	reg_t lpuart8_stop_req : 1;
	reg_t lpi2c1_stop_ack  : 1;
	reg_t lpi2c2_stop_ack  : 1;
	reg_t lpi2c3_stop_ack  : 1;
	reg_t lpi2c4_stop_ack  : 1;
	reg_t lpspi1_stop_ack  : 1;
	reg_t lpspi2_stop_ack  : 1;
	reg_t lpspi3_stop_ack  : 1;
	reg_t lpspi4_stop_ack  : 1;
	reg_t lpuart1_stop_ack : 1;
	reg_t lpuart2_stop_ack : 1;
	reg_t lpuart3_stop_ack : 1;
	reg_t lpuart4_stop_ack : 1;
	reg_t lpuart5_stop_ack : 1;
	reg_t lpuart6_stop_ack : 1;
	reg_t lpuart7_stop_ack : 1;
	reg_t lpuart8_stop_ack : 1;
} IOMUXC_GPR_GPR7_t;
#define IOMUXC_GPR_GPR7         ((IOMUXC_GPR_GPR7_t*)0x400AC01Cu)
#define IOMUXC_GPR_GPR7_RAW     ((reg_t*)0x400AC01Cu)

typedef volatile struct {
	reg_t lpi2c1_ipg_stop_mode	: 1;
	reg_t lp12c1_ipg_doze		: 1;
	reg_t lpi2c2_ipg_stop_mode	: 1;
	reg_t lpi2c2_ipg_doze		: 1;
	reg_t lpi2c3_ipg_stop_mode	: 1;
	reg_t lpi2c3_ipg_doze		: 1;
	reg_t lpi2c4_ipg_stop_mode	: 1;
	reg_t lpi2c4_ipg_doze		: 1;
	reg_t lpspi1_ipg_stop_mode	: 1;
	reg_t lpspi1_ipg_doze		: 1;
	reg_t lpspi2_ipg_stop_mode	: 1;
	reg_t lpspi2_ipg_doze		: 1;
	reg_t lpspi3_ipg_stop_mode	: 1;
	reg_t lpspi3_ipg_doze		: 1;
	reg_t lpspi4_ipg_stop_mode	: 1;
	reg_t lpspi4_ipg_doze		: 1;
	reg_t lpuart1_ipg_stop_mode : 1;
	reg_t lpuart1_ipg_doze		: 1;
	reg_t lpuart2_ipg_stop_mode : 1;
	reg_t lpuart2_ipg_doze		: 1;
	reg_t lpuart3_ipg_stop_mode : 1;
	reg_t lpuart3_ipg_doze		: 1;
	reg_t lpuart4_ipg_stop_mode : 1;
	reg_t lpuart4_ipg_doze		: 1;
	reg_t lpuart5_ipg_stop_mode : 1;
	reg_t lpuart5_ipg_doze		: 1;
	reg_t lpuart6_ipg_stop_mode : 1;
	reg_t lpuart6_ipg_doze		: 1;
	reg_t lpuart7_ipg_stop_mode : 1;
	reg_t lpuart7_ipg_doze		: 1;
	reg_t lpuart8_ipg_stop_mode : 1;
	reg_t lpuart8_ipg_doze		: 1;
} IOMUXC_GPR_GPR8_t;
#define IOMUXC_GPR_GPR8         ((IOMUXC_GPR_GPR8_t*)0x400AC020u)
#define IOMUXC_GPR_GPR8_RAW     ((reg_t*)0x400AC020u)

typedef volatile struct {
	reg_t reserved : 32;
} IOMUXC_GPR_GPR9_t;
#define IOMUXC_GPR_GPR9         ((IOMUXC_GPR_GPR9_t*)0x400AC024u)
#define IOMUXC_GPR_GPR9_RAW     ((reg_t*)0x400AC024u)

typedef volatile struct {
	reg_t niden						  : 1;
	reg_t dbg_en					  : 1;
	reg_t sec_err_resp				  : 1;
	reg_t							  : 1;
	reg_t dcpkey_ocotp_or_keymux	  : 1;
	reg_t							  : 3;
	reg_t ocram_tz_en				  : 1;
	reg_t ocram_tz_addr				  : 7;
	reg_t lock_niden				  : 1;
	reg_t lock_dbg_en				  : 1;
	reg_t lock_sec_err_resp			  : 1;
	reg_t							  : 1;
	reg_t lock_dcpkey_ocotp_or_keymux : 1;
	reg_t							  : 3;
	reg_t lock_ocram_tz_en			  : 1;
	reg_t lock_ocram_tz_addr		  : 7;
} IOMUXC_GPR_GPR10_t;
#define IOMUXC_GPR_GPR10        ((IOMUXC_GPR_GPR10_t*)0x400AC028u)
#define IOMUXC_GPR_GPR10_RAW    ((reg_t*)0x400AC028u)

typedef volatile struct {
	reg_t m7_apc_ar_r0_ctrl : 2;
	reg_t m7_apc_ar_r1_ctrl : 2;
	reg_t m7_apc_ar_r2_ctrl : 2;
	reg_t m7_apc_ar_r3_ctrl : 2;
	reg_t bee_de_rx_en		: 4;
	reg_t					: 20;
} IOMUXC_GPR_GPR11_t;
#define IOMUXC_GPR_GPR11        ((IOMUXC_GPR_GPR11_t*)0x400AC02Cu)
#define IOMUXC_GPR_GPR11_RAW    ((reg_t*)0x400AC02Cu)

typedef volatile struct {
	reg_t flexio1_ipg_stop_mode : 1;
	reg_t flexio1_ipg_doze		: 1;
	reg_t flexio2_ipg_stop_mode : 1;
	reg_t flexio2_ipg_doze		: 1;
	reg_t acmp_ipg_stop_mode	: 1;
	reg_t flexio3_ipg_stop_mode : 1;
	reg_t flexio3_ipg_doze		: 1;
	reg_t						: 25;
} IOMUXC_GPR_GPR12_t;
#define IOMUXC_GPR_GPR12        ((IOMUXC_GPR_GPR12_t*)0x400AC030u)
#define IOMUXC_GPR_GPR12_RAW    ((reg_t*)0x400AC030u)

typedef volatile struct {
	reg_t arcache_usdhc	 : 1;
	reg_t awcache_usdhc	 : 1;
	reg_t				 : 2;
	reg_t canfd_stop_req : 1;
	reg_t				 : 2;
	reg_t cache_enet	 : 1;
	reg_t				 : 5;
	reg_t cache_usb		 : 1;
	reg_t				 : 6;
	reg_t canfd_stop_ack : 1;
	reg_t				 : 11;
} IOMUXC_GPR_GPR13_t;
#define IOMUXC_GPR_GPR13        ((IOMUXC_GPR_GPR13_t*)0x400AC034u)
#define IOMUXC_GPR_GPR13_RAW    ((reg_t*)0x400AC034u)

typedef volatile struct {
	reg_t acmp1_cmp_igen_trim_dn : 1;
	reg_t acmp2_cmp_igen_trim_dn : 1;
	reg_t acmp3_cmp_igen_trim_dn : 1;
	reg_t acmp4_cmp_igen_trim_dn : 1;
	reg_t acmp1_cmp_igen_trim_up : 1;
	reg_t acmp2_cmp_igen_trim_up : 1;
	reg_t acmp3_cmp_igen_trim_up : 1;
	reg_t acmp4_cmp_igen_trim_up : 1;
	reg_t acmp1_sample_sync_en	 : 1;
	reg_t acmp2_sample_sync_en	 : 1;
	reg_t acmp3_sample_sync_en	 : 1;
	reg_t acmp4_sample_sync_en	 : 1;
	reg_t						 : 20;
} IOMUXC_GPR_GPR14_t;
#define IOMUXC_GPR_GPR14        ((IOMUXC_GPR_GPR14_t*)0x400AC038u)
#define IOMUXC_GPR_GPR14_RAW    ((reg_t*)0x400AC038u)

typedef volatile struct {
	reg_t reserved : 32;
} IOMUXC_GPR_GPR15_t;
#define IOMUXC_GPR_GPR15        ((IOMUXC_GPR_GPR15_t*)0x400AC03Cu)
#define IOMUXC_GPR_GPR15_RAW    ((reg_t*)0x400AC03Cu)

typedef volatile struct {
	reg_t					   : 2;
	reg_t flexram_bank_cfg_sel : 1;
	reg_t					   : 4;
	reg_t cm7_init_vtor		   : 25;
} IOMUXC_GPR_GPR16_t;
#define IOMUXC_GPR_GPR16        ((IOMUXC_GPR_GPR16_t*)0x400AC040u)
#define IOMUXC_GPR_GPR16_RAW    ((reg_t*)0x400AC040u)

typedef volatile struct {
	reg_t flexram_bank_cfg : 32;
} IOMUXC_GPR_GPR17_t;
#define IOMUXC_GPR_GPR17        ((IOMUXC_GPR_GPR17_t*)0x400AC044u)
#define IOMUXC_GPR_GPR17_RAW    ((reg_t*)0x400AC044u)

typedef volatile struct {
	reg_t lock_m7_apc_ac_r0_bot : 1;
	reg_t						: 2;
	reg_t m7_apc_ac_r0_bot		: 29;
} IOMUXC_GPR_GPR18_t;
#define IOMUXC_GPR_GPR18        ((IOMUXC_GPR_GPR18_t*)0x400AC048u)
#define IOMUXC_GPR_GPR18_RAW    ((reg_t*)0x400AC048u)

typedef volatile struct {
	reg_t lock_m7_apc_ac_r0_top : 1;
	reg_t						: 2;
	reg_t m7_apc_ac_r0_top		: 29;
} IOMUXC_GPR_GPR19_t;
#define IOMUXC_GPR_GPR19        ((IOMUXC_GPR_GPR19_t*)0x400AC04Cu)
#define IOMUXC_GPR_GPR19_RAW    ((reg_t*)0x400AC04Cu)

typedef volatile struct {
	reg_t lock_m7_apc_ac_r1_bot : 1;
	reg_t						: 2;
	reg_t m7_apc_ac_r1_bot		: 29;
} IOMUXC_GPR_GPR20_t;
