Pandabear1125/tycore/src/imxrt_regmap.h
#define IOMUXC_GPR_GPR20        ((IOMUXC_GPR_GPR20_t*)0x400AC050u)
#define IOMUXC_GPR_GPR20_RAW    ((reg_t*)0x400AC050u)

typedef volatile struct {
	reg_t lock_m7_apc_ac_r1_top : 1;
	reg_t						: 2;
	reg_t m7_apc_ac_r1_top		: 29;
} IOMUXC_GPR_GPR21_t;
#define IOMUXC_GPR_GPR21        ((IOMUXC_GPR_GPR21_t*)0x400AC054u)
#define IOMUXC_GPR_GPR21_RAW    ((reg_t*)0x400AC054u)

typedef volatile struct {
	reg_t lock_m7_apc_ac_r2_bot : 1;
	reg_t						: 2;
	reg_t m7_apc_ac_r2_bot		: 29;
} IOMUXC_GPR_GPR22_t;
#define IOMUXC_GPR_GPR22        ((IOMUXC_GPR_GPR22_t*)0x400AC058u)
#define IOMUXC_GPR_GPR22_RAW    ((reg_t*)0x400AC058u)

typedef volatile struct {
	reg_t lock_m7_apc_ac_r2_top : 1;
	reg_t						: 2;
	reg_t m7_apc_ac_r2_top		: 29;
} IOMUXC_GPR_GPR23_t;
#define IOMUXC_GPR_GPR23        ((IOMUXC_GPR_GPR23_t*)0x400AC05Cu)
#define IOMUXC_GPR_GPR23_RAW    ((reg_t*)0x400AC05Cu)

typedef volatile struct {
	reg_t lock_m7_apc_ac_r3_bot : 1;
	reg_t						: 2;
	reg_t m7_apc_ac_r3_bot		: 29;
} IOMUXC_GPR_GPR24_t;
#define IOMUXC_GPR_GPR24        ((IOMUXC_GPR_GPR24_t*)0x400AC060u)
#define IOMUXC_GPR_GPR24_RAW    ((reg_t*)0x400AC060u)

typedef volatile struct {
	reg_t lock_m7_apc_ac_r3_top : 1;
	reg_t						: 2;
	reg_t m7_apc_ac_r3_top		: 29;
} IOMUXC_GPR_GPR25_t;
#define IOMUXC_GPR_GPR25        ((IOMUXC_GPR_GPR25_t*)0x400AC064u)
#define IOMUXC_GPR_GPR25_RAW    ((reg_t*)0x400AC064u)

typedef volatile struct {
	reg_t gpio_mux1_gpio_sel : 32;
} IOMUXC_GPR_GPR26_t;
#define IOMUXC_GPR_GPR26        ((IOMUXC_GPR_GPR26_t*)0x400AC068u)
#define IOMUXC_GPR_GPR26_RAW    ((reg_t*)0x400AC068u)

typedef volatile struct {
	reg_t gpio_mux2_gpio_sel : 32;
} IOMUXC_GPR_GPR27_t;
#define IOMUXC_GPR_GPR27        ((IOMUXC_GPR_GPR27_t*)0x400AC06Cu)
#define IOMUXC_GPR_GPR27_RAW    ((reg_t*)0x400AC06Cu)

typedef volatile struct {
	reg_t gpio_mux3_gpio_sel : 32;
} IOMUXC_GPR_GPR28_t;
#define IOMUXC_GPR_GPR28        ((IOMUXC_GPR_GPR28_t*)0x400AC070u)
#define IOMUXC_GPR_GPR28_RAW    ((reg_t*)0x400AC070u)

typedef volatile struct {
	reg_t gpio_mux4_gpio_sel : 32;
} IOMUXC_GPR_GPR29_t;
#define IOMUXC_GPR_GPR29        ((IOMUXC_GPR_GPR29_t*)0x400AC074u)
#define IOMUXC_GPR_GPR29_RAW    ((reg_t*)0x400AC074u)

typedef volatile struct {
	reg_t						   : 12;
	reg_t flexspi_remap_addr_start : 20;
} IOMUXC_GPR_GPR30_t;
#define IOMUXC_GPR_GPR30        ((IOMUXC_GPR_GPR30_t*)0x400AC078u)
#define IOMUXC_GPR_GPR30_RAW    ((reg_t*)0x400AC078u)

typedef volatile struct {
	reg_t						 : 12;
	reg_t flexspi_remap_addr_end : 20;
} IOMUXC_GPR_GPR31_t;
#define IOMUXC_GPR_GPR31        ((IOMUXC_GPR_GPR31_t*)0x400AC07Cu)
#define IOMUXC_GPR_GPR31_RAW    ((reg_t*)0x400AC07Cu)

typedef volatile struct {
	reg_t							: 12;
	reg_t flexspi_remap_addr_offset : 20;
} IOMUXC_GPR_GPR32_t;
#define IOMUXC_GPR_GPR32        ((IOMUXC_GPR_GPR32_t*)0x400AC080u)
#define IOMUXC_GPR_GPR32_RAW    ((reg_t*)0x400AC080u)

typedef volatile struct {
	reg_t ocram2_tz_en		  : 1;
	reg_t ocram2_tz_addr	  : 7;
	reg_t					  : 8;
	reg_t lock_ocram2_tz_en	  : 1;
	reg_t lock_ocram2_tz_addr : 7;
	reg_t					  : 8;
} IOMUXC_GPR_GPR33_t;
#define IOMUXC_GPR_GPR33        ((IOMUXC_GPR_GPR33_t*)0x400AC084u)
#define IOMUXC_GPR_GPR33_RAW    ((reg_t*)0x400AC084u)

typedef volatile struct {
	reg_t sip_test_mux_boot_pin_sel : 8;
	reg_t sip_test_mux_qspi_sip_en	: 1;
	reg_t							: 23;
} IOMUXC_GPR_GPR34_t;
#define IOMUXC_GPR_GPR34        ((IOMUXC_GPR_GPR34_t*)0x400AC088u)
#define IOMUXC_GPR_GPR34_RAW    ((reg_t*)0x400AC088u)

#pragma endregion  // IOMUXC_GPR

// IOMUXC SNVS Memory Map/Register Definition
// RM 11.4

#pragma region IOMUXC_SNVS

#define IOMUXC_SNVS_SW_MUX_CTL_PAD_WAKEUP               ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8000u)
#define IOMUXC_SNVS_SW_MUX_CTL_PAD_WAKEUP_RAW           ((reg_t*)0x401F8000u)
#define IOMUXC_SNVS_SW_MUX_CTL_PAD_PMIC_ON_REQ          ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8004u)
#define IOMUXC_SNVS_SW_MUX_CTL_PAD_PMIC_ON_REQ_RAW      ((reg_t*)0x401F8004u)
#define IOMUXC_SNVS_SW_MUX_CTL_PAD_PMIC_STBY_REQ        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8008u)
#define IOMUXC_SNVS_SW_MUX_CTL_PAD_PMIC_STBY_REQ_RAW    ((reg_t*)0x401F8008u)

#define IOMUXC_SNVS_SW_PAD_CTL_PAD_TEST_MODE            ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F800Cu)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_TEST_MODE_RAW        ((reg_t*)0x401F800Cu)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_POR_B                ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8010u)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_POR_B_RAW            ((reg_t*)0x401F8010u)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_ONOFF                ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8014u)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_ONOFF_RAW            ((reg_t*)0x401F8014u)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_WAKEUP               ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8018u)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_WAKEUP_RAW           ((reg_t*)0x401F8018u)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_PMIC_ON_REQ          ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F801Cu)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_PMIC_ON_REQ_RAW      ((reg_t*)0x401F801Cu)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_PMIC_STBY_REQ        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8020u)
#define IOMUXC_SNVS_SW_PAD_CTL_PAD_PMIC_STBY_REQ_RAW    ((reg_t*)0x401F8020u)

#pragma endregion  // IOMUXC_SNVS

// IOMUXC SNVS GPR Memory Map/Register Definition
// RM 11.5

#pragma region IOMUXC_SNVS_GPR

typedef volatile struct {
	reg_t reserved : 32;
} IOMUXC_SNVS_GPR_GPR0_t;
#define IOMUXC_SNVS_GPR_GPR0        ((IOMUXC_SNVS_GPR_GPR0_t*)0x401A4000u)
#define IOMUXC_SNVS_GPR_GPR0_RAW    ((reg_t*)0x401A4000u)

typedef volatile struct {
	reg_t reserved : 32;
} IOMUXC_SNVS_GPR_GPR1_t;
#define IOMUXC_SNVS_GPR_GPR1       ((IOMUXC_SNVS_GPR_GPR1_t*)0x401A4004u)
#define IOMUXC_SNVS_GPR_GPR1_RAW   ((reg_t*)0x401A4004u)

typedef volatile struct {
	reg_t reserved : 32;
} IOMUXC_SNVS_GPR_GPR2_t;
#define IOMUXC_SNVS_GPR_GPR2        ((IOMUXC_SNVS_GPR_GPR2_t*)0x401A4008u)
#define IOMUXC_SNVS_GPR_GPR2_RAW    ((reg_t*)0x401A4008u)

typedef volatile struct {
	reg_t lpsr_mode_enable	   : 1;
	reg_t dcdc_status_capt_clr : 1;
	reg_t por_pull_type		   : 2;
	reg_t					   : 12;
	reg_t dcdc_in_low_vol	   : 1;
	reg_t dcdc_over_cur		   : 1;
	reg_t dcdc_over_vol		   : 1;
	reg_t dcdc_sts_dc_ok	   : 1;
	reg_t					   : 12;
} IOMUXC_SNVS_GPR_GPR3_t;
#define IOMUXC_SNVS_GPR_GPR3        ((IOMUXC_SNVS_GPR_GPR3_t*)0x401A400Cu)
#define IOMUXC_SNVS_GPR_GPR3_RAW    ((reg_t*)0x401A400Cu)

#pragma endregion

// IOMUXC SW MUX Memory Map/Register Definition
// RM 11.6

#pragma region IOMUXC_SW_MUX

// TODO do these require raw access?

