Pandabear1125/tycore/src/imxrt_regmap.h
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_00       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8014u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_01       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8018u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_02       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F801Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_03       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8020u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_04       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8024u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_05       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8028u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_06       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F802Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_07       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8030u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_08       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8034u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_09       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8038u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_10       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F803Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_11       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8040u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_12       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8044u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_13       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8048u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_14       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F804Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_15       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8050u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_16       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8054u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_17       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8058u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_18       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F805Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_19       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8060u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_20       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8064u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_21       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8068u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_22       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F806Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_23       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8070u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_24       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8074u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_25       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8078u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_26       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F807Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_27       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8080u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_28       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8084u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_29       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8088u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_30       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F808Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_31       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8090u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_32       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8094u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_33       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8098u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_34       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F809Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_35       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80A0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_36       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80A4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_37       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80A8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_38       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80ACu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_39       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80B0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_40       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80B4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_EMC_41       ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80B8u)

#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_00     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80BCu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_01     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80C0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80C4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_03     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80C8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_04     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80CCu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_05     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80D0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_06     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80D4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_07     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80D8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_08     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80DCu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_09     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80E0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_10     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80E4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_11     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80E8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_12     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80ECu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_13     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80F0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_14     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80F4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_15     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80F8u)

#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_00     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F80FCu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_01     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8100u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_02     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8104u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_03     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8108u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_04     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F810Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_05     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8110u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_06     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8114u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_07     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8118u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_08     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F811Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_09     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8120u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_10     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8124u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_11     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8128u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_12     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F812Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_13     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8130u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_14     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8134u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B1_15     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8138u)

#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_00        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F813Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_01        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8140u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_02        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8144u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_03        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8148u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_04        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F814Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_05        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8150u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_06        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8154u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_07        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8158u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_08        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F815Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_09        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8160u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_10        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8164u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_11        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8168u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_12        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F816Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_13        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8170u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_14        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8174u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B0_15        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8178u)

#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_00        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F817Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_01        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8180u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_02        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8184u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_03        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8188u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_04        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F818Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_05        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8190u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_06        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8194u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_07        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8198u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_08        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F819Cu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_09        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81A0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_10        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81A4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_11        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81A8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_12        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81ACu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_13        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81B0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_14        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81B4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_B1_15        ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81B8u)

