Pandabear1125/tycore/src/imxrt_regmap.h
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_00     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81BCu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_01     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81C0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_02     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81C4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_03     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81C8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_04     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81CCu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B0_05     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81D0u)

#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_00     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81D4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_01     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81D8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_02     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81DCu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_03     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81E0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_04     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81E4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_05     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81E8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_06     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81ECu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_07     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81F0u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_08     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81F4u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_09     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81F8u)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_10     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F81FCu)
#define IOMUXC_SW_MUX_CTL_PAD_GPIO_SD_B1_11     ((IOMUXC_SW_MUX_CTL_PAD_t*)0x401F8200u)

#pragma endregion  // IOMUXC_SW_MUX

// IOMUXC SW PAD Memory Map/Register Definition
// RM 11.6

#pragma region IOMUXC_SW_PAD

#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_00       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8204u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_01       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8208u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_02       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F820Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_03       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8210u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_04       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8214u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_05       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8218u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_06       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F821Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_07       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8220u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_08       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8224u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_09       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8228u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_10       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F822Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_11       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8230u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_12       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8234u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_13       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8238u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_14       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F823Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_15       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8240u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_16       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8244u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_17       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8248u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_18       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F824Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_19       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8250u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_20       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8254u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_21       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8258u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_22       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F825Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_23       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8260u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_24       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8264u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_25       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8268u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_26       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F826Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_27       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8270u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_28       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8274u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_29       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8278u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_30       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F827Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_31       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8280u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_32       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8284u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_33       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8288u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_34       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F828Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_35       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8290u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_36       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8294u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_37       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8298u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_38       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F829Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_39       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82A0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_40       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82A4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_EMC_41       ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82A8u)

#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_00     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82ACu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_01     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82B0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_02     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82B4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_03     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82B8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_04     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82BCu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_05     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82C0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_06     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82C4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_07     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82C8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_08     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82CCu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_09     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82D0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_10     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82D4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_11     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82D8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_12     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82DCu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_13     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82E0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_14     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82E4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_15     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82E8u)

