Pandabear1125/tycore/src/imxrt_regmap.h
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_00     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82ECu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_01     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82F0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_02     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82F4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_03     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82F8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_04     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F82FCu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_05     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8300u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_06     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8304u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_07     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8308u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_08     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F830Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_09     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8310u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_10     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8314u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_11     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8318u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_12     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F831Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_13     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8320u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_14     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8324u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B1_15     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8328u)

#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_00        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F832Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_01        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8330u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_02        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8334u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_03        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8338u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_04        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F833Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_05        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8340u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_06        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8344u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_07        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8348u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_08        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F834Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_09        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8350u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_10        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8354u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_11        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8358u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_12        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F835Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_13        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8360u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_14        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8364u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B0_15        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8368u)

#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_00        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F836Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_01        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8370u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_02        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8374u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_03        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8378u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_04        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F837Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_05        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8380u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_06        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8384u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_07        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8388u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_08        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F838Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_09        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8390u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_10        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8394u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_11        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F8398u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_12        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F839Cu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_13        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83A0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_14        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83A4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_B1_15        ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83A8u)

#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_00     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83ACu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_01     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83B0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_02     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83B4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_03     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83B8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_04     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83BCu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B0_05     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83C0u)

#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_00     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83C4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_01     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83C8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_02     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83CCu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_03     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83D0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_04     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83D4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_05     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83D8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_06     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83DCu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_07     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83E0u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_08     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83E4u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_09     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83E8u)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_10     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83ECu)
#define IOMUXC_SW_PAD_CTL_PAD_GPIO_SD_B1_11     ((IOMUXC_SW_PAD_CTL_PAD_t*)0x401F83F0u)

#pragma endregion  // IOMUXC_SW_PAD

// IOMUXC SELECT_INPUT DAISY Register Definition
// RM 11.6

#pragma region IOMUXC_SELECT_INPUT_DAISY

typedef volatile struct {
	reg_t daisy : 3;
	reg_t		: 29;
} IOMUXC_SELECT_INPUT_DAISY_t;

