Pandabear1125/tycore/src/imxrt_regmap.h
#define IOMUXC_ANATOP_USB_OTG1_ID_SELECT_INPUT          ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F83F4u)
#define IOMUXC_ANATOP_USB_OTG2_ID_SELECT_INPUT          ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F83F8u)
#define IOMUXC_CCM_PMIC_READY_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F83FCu)
#define IOMUXC_CSI_DATA02_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8400u)
#define IOMUXC_CSI_DATA03_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8404u)
#define IOMUXC_CSI_DATA04_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8408u)
#define IOMUXC_CSI_DATA05_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F840Cu)
#define IOMUXC_CSI_DATA06_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8410u)
#define IOMUXC_CSI_DATA07_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8414u)
#define IOMUXC_CSI_DATA08_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8418u)
#define IOMUXC_CSI_DATA09_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F841Cu)
#define IOMUXC_CSI_HSYNC_SELECT_INPUT                   ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8420u)
#define IOMUXC_CSI_PIXCLK_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8424u)
#define IOMUXC_CSI_VSYNC_SELECT_INPUT                   ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8428u)
#define IOMUXC_ENET_IPG_CLK_RMII_SELECT_INPUT           ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F842Cu)
#define IOMUXC_ENET_MDIO_SELECT_INPUT                   ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8430u)
#define IOMUXC_ENET0_RXDATA_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8434u)
#define IOMUXC_ENET1_RXDATA_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8438u)
#define IOMUXC_ENET_RXEN_SELECT_INPUT                   ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F843Cu)
#define IOMUXC_ENET_RXERR_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8440u)
#define IOMUXC_ENET0_TIMER_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8444u)
#define IOMUXC_ENET_TXCLK_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8448u)
#define IOMUXC_FLEXCAN1_RX_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F844Cu)
#define IOMUXC_FLEXCAN2_RX_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8450u)
#define IOMUXC_FLEXPWM1_PWMA3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8454u)
#define IOMUXC_FLEXPWM1_PWMA0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8458u)
#define IOMUXC_FLEXPWM1_PWMA1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F845Cu)
#define IOMUXC_FLEXPWM1_PWMA2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8460u)
#define IOMUXC_FLEXPWM1_PWMB3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8464u)
#define IOMUXC_FLEXPWM1_PWMB0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8468u)
#define IOMUXC_FLEXPWM1_PWMB1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F846Cu)
#define IOMUXC_FLEXPWM1_PWMB2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8470u)
#define IOMUXC_FLEXPWM2_PWMA3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8474u)
#define IOMUXC_FLEXPWM2_PWMA0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8478u)
#define IOMUXC_FLEXPWM2_PWMA1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F847Cu)
#define IOMUXC_FLEXPWM2_PWMA2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8480u)
#define IOMUXC_FLEXPWM2_PWMB3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8484u)
#define IOMUXC_FLEXPWM2_PWMB0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8488u)
#define IOMUXC_FLEXPWM2_PWMB1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F848Cu)
#define IOMUXC_FLEXPWM2_PWMB2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8490u)
#define IOMUXC_FLEXPWM4_PWMA0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8494u)
#define IOMUXC_FLEXPWM4_PWMA1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8498u)
#define IOMUXC_FLEXPWM4_PWMA2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F849Cu)
#define IOMUXC_FLEXPWM4_PWMA3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84A0u)
#define IOMUXC_FLEXSPIA_DQS_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84A4u)
#define IOMUXC_FLEXSPIA_DATA0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84A8u)
#define IOMUXC_FLEXSPIA_DATA1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84ACu)
#define IOMUXC_FLEXSPIA_DATA2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84B0u)
#define IOMUXC_FLEXSPIA_DATA3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84B4u)
#define IOMUXC_FLEXSPIB_DATA0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84B8u)
#define IOMUXC_FLEXSPIB_DATA1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84BCu)
#define IOMUXC_FLEXSPIB_DATA2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84C0u)
#define IOMUXC_FLEXSPIB_DATA3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84C4u)
#define IOMUXC_FLEXSPIA_SCK_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84C8u)
#define IOMUXC_LPI2C1_SCL_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84CCu)
#define IOMUXC_LPI2C1_SDA_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84D0u)
#define IOMUXC_LPI2C2_SCL_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84D4u)
#define IOMUXC_LPI2C2_SDA_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84D8u)
#define IOMUXC_LPI2C3_SCL_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84DCu)
#define IOMUXC_LPI2C3_SDA_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84E0u)
#define IOMUXC_LPI2C4_SCL_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84E4u)
#define IOMUXC_LPI2C4_SDA_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84E8u)
#define IOMUXC_LPSPI1_PCS0_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84ECu)
#define IOMUXC_LPSPI1_SCK_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84F0u)
#define IOMUXC_LPSPI1_SDI_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84F4u)
#define IOMUXC_LPSPI1_SDO_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84F8u)
#define IOMUXC_LPSPI2_PCS0_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F84FCu)
#define IOMUXC_LPSPI2_SCK_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8500u)
#define IOMUXC_LPSPI2_SDI_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8504u)
#define IOMUXC_LPSPI2_SDO_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8508u)
#define IOMUXC_LPSPI3_PCS0_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F850Cu)
#define IOMUXC_LPSPI3_SCK_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8510u)
#define IOMUXC_LPSPI3_SDI_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8514u)
#define IOMUXC_LPSPI3_SDO_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8518u)
#define IOMUXC_LPSPI4_PCS0_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F851Cu)
#define IOMUXC_LPSPI4_SCK_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8520u)
#define IOMUXC_LPSPI4_SDI_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8524u)
#define IOMUXC_LPSPI4_SDO_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8528u)
#define IOMUXC_LPUART2_RX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F852Cu)
#define IOMUXC_LPUART2_TX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8530u)
#define IOMUXC_LPUART3_CTS_B_SELECT_INPUT               ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8534u)
#define IOMUXC_LPUART3_RX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8538u)
#define IOMUXC_LPUART3_TX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F853Cu)
#define IOMUXC_LPUART4_RX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8540u)
#define IOMUXC_LPUART4_TX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8544u)
#define IOMUXC_LPUART5_RX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8548u)
#define IOMUXC_LPUART5_TX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F854Cu)
#define IOMUXC_LPUART6_RX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8550u)
#define IOMUXC_LPUART6_TX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8554u)
#define IOMUXC_LPUART7_RX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8558u)
#define IOMUXC_LPUART7_TX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F855Cu)
#define IOMUXC_LPUART8_RX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8560u)
#define IOMUXC_LPUART8_TX_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8564u)
#define IOMUXC_NMI_SELECT_INPUT                         ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8568u)
#define IOMUXC_QTIMER2_TIMER0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F856Cu)
#define IOMUXC_QTIMER2_TIMER1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8570u)
#define IOMUXC_QTIMER2_TIMER2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8574u)
#define IOMUXC_QTIMER2_TIMER3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8578u)
#define IOMUXC_QTIMER3_TIMER0_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F857Cu)
#define IOMUXC_QTIMER3_TIMER1_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8580u)
#define IOMUXC_QTIMER3_TIMER2_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8584u)
#define IOMUXC_QTIMER3_TIMER3_SELECT_INPUT              ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8588u)
#define IOMUXC_SAI1_MCLK2_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F858Cu)
#define IOMUXC_SAI1_RX_BCLK_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8590u)
#define IOMUXC_SAI1_RX_DATA0_SELECT_INPUT               ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8594u)
#define IOMUXC_SAI1_RX_DATA1_SELECT_INPUT               ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8598u)
#define IOMUXC_SAI1_RX_DATA2_SELECT_INPUT               ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F859Cu)
#define IOMUXC_SAI1_RX_DATA3_SELECT_INPUT               ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85A0u)
#define IOMUXC_SAI1_RX_SYNC_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85A4u)
#define IOMUXC_SAI1_TX_BCLK_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85A8u)
#define IOMUXC_SAI1_TX_SYNC_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85ACu)
#define IOMUXC_SAI2_MCLK2_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85B0u)
#define IOMUXC_SAI2_RX_BCLK_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85B4u)
#define IOMUXC_SAI2_RX_DATA0_SELECT_INPUT               ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85B8u)
#define IOMUXC_SAI2_RX_SYNC_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85BCu)
#define IOMUXC_SAI2_TX_BCLK_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85C0u)
#define IOMUXC_SAI2_TX_SYNC_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85C4u)
#define IOMUXC_SPDIF_IN_SELECT_INPUT                    ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85C8u)
#define IOMUXC_USB_OTG2_OC_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85CCu)
#define IOMUXC_USB_OTG1_OC_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85D0u)
#define IOMUXC_USDHC1_CD_B_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85D4u)
#define IOMUXC_USDHC1_WP_SELECT_INPUT                   ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85D8u)
#define IOMUXC_USDHC2_CLK_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85DCu)
#define IOMUXC_USDHC2_CD_B_SELECT_INPUT                 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85E0u)
#define IOMUXC_USDHC2_CMD_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85E4u)
#define IOMUXC_USDHC2_DATA0_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85E8u)
#define IOMUXC_USDHC2_DATA1_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85ECu)
#define IOMUXC_USDHC2_DATA2_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85F0u)
#define IOMUXC_USDHC2_DATA3_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85F4u)
#define IOMUXC_USDHC2_DATA4_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85F8u)
#define IOMUXC_USDHC2_DATA5_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F85FCu)
#define IOMUXC_USDHC2_DATA6_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8600u)
#define IOMUXC_USDHC2_DATA7_SELECT_INPUT                ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8604u)
#define IOMUXC_USDHC2_WP_SELECT_INPUT                   ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8608u)
#define IOMUXC_XBAR1_IN02_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F860Cu)
#define IOMUXC_XBAR1_IN03_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8610u)
#define IOMUXC_XBAR1_IN04_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8614u)
#define IOMUXC_XBAR1_IN05_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8618u)
#define IOMUXC_XBAR1_IN06_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F861Cu)
#define IOMUXC_XBAR1_IN07_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8620u)
#define IOMUXC_XBAR1_IN08_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8624u)
#define IOMUXC_XBAR1_IN09_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8628u)
#define IOMUXC_XBAR1_IN17_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F862Cu)
#define IOMUXC_XBAR1_IN18_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8630u)
#define IOMUXC_XBAR1_IN20_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8634u)
#define IOMUXC_XBAR1_IN22_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8638u)
#define IOMUXC_XBAR1_IN23_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F863Cu)
#define IOMUXC_XBAR1_IN24_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8640u)
#define IOMUXC_XBAR1_IN14_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8644u)
#define IOMUXC_XBAR1_IN15_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8648u)
#define IOMUXC_XBAR1_IN16_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F864Cu)
#define IOMUXC_XBAR1_IN25_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8650u)
#define IOMUXC_XBAR1_IN19_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8654u)
#define IOMUXC_XBAR1_IN21_SELECT_INPUT                  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8658u)
#define IOMUXC_ENET2_IPG_CLK_RMII_SELECT_INPUT          ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F870Cu)
#define IOMUXC_ENET2_IPP_IND_MAC0_MDIO_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8710u)
#define IOMUXC_ENET2_IPP_IND_MAC0_RXDATA_SELECT_INPUT_0 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8714u)
#define IOMUXC_ENET2_IPP_IND_MAC0_RXDATA_SELECT_INPUT_1 ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8718u)
#define IOMUXC_ENET2_IPP_IND_MAC0_RXEN_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F871Cu)
#define IOMUXC_ENET2_IPP_IND_MAC0_RXERR_SELECT_INPUT    ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8720u)
#define IOMUXC_ENET2_IPP_IND_MAC0_TIMER_SELECT_INPUT_0  ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8724u)
#define IOMUXC_ENET2_IPP_IND_MAC0_TXCLK_SELECT_INPUT    ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8728u)
#define IOMUXC_FLEXSPI2_IPP_IND_DQS_FA_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F872Cu)
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FA_BIT0_SELECT_INPUT ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8730u)
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FA_BIT1_SELECT_INPUT ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8734u)
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FA_BIT2_SELECT_INPUT ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8738u)
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FA_BIT3_SELECT_INPUT ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F873Cu)
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FB_BIT0_SELECT_INPUT ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8740u)
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FB_BIT1_SELECT_INPUT ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8744u)
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FB_BIT2_SELECT_INPUT ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8748u)
#define IOMUXC_FLEXSPI2_IPP_IND_IO_FB_BIT3_SELECT_INPUT ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F874Cu)
#define IOMUXC_FLEXSPI2_IPP_IND_SCK_FA_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8750u)
#define IOMUXC_FLEXSPI2_IPP_IND_SCK_FB_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8754u)
#define IOMUXC_GPT1_IPP_IND_CAPIN1_SELECT_INPUT         ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8758u)
#define IOMUXC_GPT1_IPP_IND_CAPIN2_SELECT_INPUT         ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F875Cu)
#define IOMUXC_GPT1_IPP_IND_CLKIN_SELECT_INPUT          ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8760u)
#define IOMUXC_GPT2_IPP_IND_CAPIN1_SELECT_INPUT         ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8764u)
#define IOMUXC_GPT2_IPP_IND_CAPIN2_SELECT_INPUT         ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8768u)
#define IOMUXC_GPT2_IPP_IND_CLKIN_SELECT_INPUT          ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F876Cu)
#define IOMUXC_SAI3_IPG_CLK_SAI_MCLK_SELECT_INPUT_2     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8770u)
#define IOMUXC_SAI3_IPP_IND_SAI_RXBCLK_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8774u)
#define IOMUXC_SAI3_IPP_IND_SAI_RXDATA_SELECT_INPUT_0   ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8778u)
#define IOMUXC_SAI3_IPP_IND_SAI_RXSYNC_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F877Cu)
#define IOMUXC_SAI3_IPP_IND_SAI_TXBCLK_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8780u)
#define IOMUXC_SAI3_IPP_IND_SAI_TXSYNC_SELECT_INPUT     ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8784u)
#define IOMUXC_SEMC_I_IPP_IND_DQS4_SELECT_INPUT         ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F8788u)
#define IOMUXC_CANFD_IPP_IND_CANRX_SELECT_INPUT         ((IOMUXC_SELECT_INPUT_DAISY_t*)0x401F878Cu)

#pragma endregion  // IOMUXC_SELECT_INPUT_DAISY

// General Purpose Input/Output (GPIO) Register Definition
// RM 12.1

