Pandabear1125/tycore/src/imxrt_regmap.h
#pragma region GPIO

typedef volatile struct {
	reg_t dr : 32;
} GPIO_DR_t;

typedef volatile struct {
	reg_t gdir : 32;
} GPIO_GDIR_t;

typedef volatile struct {
	reg_t psr : 32;
} GPIO_PSR_t;

typedef volatile struct {
	reg_t icr0	: 2;
	reg_t icr1	: 2;
	reg_t icr2	: 2;
	reg_t icr3	: 2;
	reg_t icr4	: 2;
	reg_t icr5	: 2;
	reg_t icr6	: 2;
	reg_t icr7	: 2;
	reg_t icr8	: 2;
	reg_t icr9	: 2;
	reg_t icr10 : 2;
	reg_t icr11 : 2;
	reg_t icr12 : 2;
	reg_t icr13 : 2;
	reg_t icr14 : 2;
	reg_t icr15 : 2;
} GPIO_ICR1_t;

typedef volatile struct {
	reg_t icr16 : 2;
	reg_t icr17 : 2;
	reg_t icr18 : 2;
	reg_t icr19 : 2;
	reg_t icr20 : 2;
	reg_t icr21 : 2;
	reg_t icr22 : 2;
	reg_t icr23 : 2;
	reg_t icr24 : 2;
	reg_t icr25 : 2;
	reg_t icr26 : 2;
	reg_t icr27 : 2;
	reg_t icr28 : 2;
	reg_t icr29 : 2;
	reg_t icr30 : 2;
	reg_t icr31 : 2;
} GPIO_ICR2_t;

typedef volatile struct {
	reg_t imr : 32;
} GPIO_IMR_t;

typedef volatile struct {
	reg_t isr : 32;
} GPIO_ISR_t;

typedef volatile struct {
	reg_t edge_sel : 32;
} GPIO_EDGE_SEL_t;

typedef volatile struct {
	reg_t dr_set : 32;
} GPIO_DR_SET_t;

typedef volatile struct {
	reg_t dr_clear : 32;
} GPIO_DR_CLEAR_t;

typedef volatile struct {
	reg_t dr_toggle : 32;
} GPIO_DR_TOGGLE_t;

typedef volatile struct {
	/* 0x0  */ GPIO_DR_t		dr;
	/* 0x4  */ GPIO_GDIR_t		gdir;
	/* 0x8  */ GPIO_PSR_t		psr;
	/* 0xC  */ GPIO_ICR1_t		icr1;
	/* 0x10 */ GPIO_ICR2_t		icr2;
	/* 0x14 */ GPIO_IMR_t		imr;
	/* 0x18 */ GPIO_ISR_t		isr;
	/* 0x1C */ GPIO_EDGE_SEL_t	edge_sel;
	/*      */ uint32_t			reserved[25];
	/* 0x84 */ GPIO_DR_SET_t	dr_set;
	/* 0x88 */ GPIO_DR_CLEAR_t	dr_clear;
	/* 0x8C */ GPIO_DR_TOGGLE_t dr_toggle;
} GPIO_t;

#define GPIO1 ((GPIO_t*)0x401B8000u)  // not used, set to gpio 6-9
#define GPIO2 ((GPIO_t*)0x401BC000u)  // not used, set to gpio 6-9
#define GPIO3 ((GPIO_t*)0x401C0000u)  // not used, set to gpio 6-9
#define GPIO4 ((GPIO_t*)0x401C4000u)  // not used, set to gpio 6-9
#define GPIO5 ((GPIO_t*)0x400C0000u)
#define GPIO6 ((GPIO_t*)0x42000000u)
#define GPIO7 ((GPIO_t*)0x42004000u)
#define GPIO8 ((GPIO_t*)0x42008000u)
#define GPIO9 ((GPIO_t*)0x4200C000u)

#pragma endregion  // GPIO

#pragma endregion  // IOMUXC_MODULE

// Clock Controller Module (CCM)
// RM 14

#pragma region CCM_MODULE

// Clock Controller Module (CCM) Memory Map/Register Definition
// RM 14.7

#pragma region CCM

typedef volatile struct {
	reg_t oscnt			   : 8;
	reg_t				   : 4;
	reg_t cosc_en		   : 1;
	reg_t				   : 8;
	reg_t reg_bypass_count : 6;
	reg_t rbc_en		   : 1;
	reg_t				   : 4;
} CCM_CCR_t;
#define CCM_CCR         ((CCM_CCR_t*)0x400FC000u)
#define CCM_CCR_RAW     ((reg_t*)0x400FC000u)

typedef volatile struct {
	reg_t ref_en_b	  : 1;
	reg_t			  : 2;
	reg_t camp2_ready : 1;
	reg_t			  : 1;
	reg_t cosc_ready  : 1;
	reg_t			  : 26;
} CCM_CSR_t;
#define CCM_CSR         ((CCM_CSR_t*)0x400FC008u)
#define CCM_CSR_RAW     ((reg_t*)0x400FC008u)

typedef volatile struct {
	reg_t pll3_sw_clk_sel : 1;
	reg_t				  : 31;
} CCM_CCSR_t;
#define CCM_CCSR        ((CCM_CCSR_t*)0x400FC00Cu)
#define CCM_CCSR_RAW    ((reg_t*)0x400FC00Cu)

typedef volatile struct {
	reg_t arm_podf : 3;
	reg_t		   : 29;
} CCM_CACRR_t;
#define CCM_CACRR       ((CCM_CACRR_t*)0x400FC010u)
#define CCM_CACRR_RAW   ((reg_t*)0x400FC010u)

typedef volatile struct {
	reg_t				   : 6;
	reg_t semc_clk_sel	   : 1;
	reg_t semc_alt_clk_sel : 1;
	reg_t ipg_podf		   : 2;
	reg_t ahb_podf		   : 3;
	reg_t				   : 3;
	reg_t semc_podf		   : 3;
	reg_t				   : 6;
	reg_t periph_clk_sel   : 1;
	reg_t				   : 1;
	reg_t periph_clk2_podf : 3;
	reg_t				   : 2;
} CCM_CBCDR_t;
#define CCM_CBCDR       ((CCM_CBCDR_t*)0x400FC014u)
#define CCM_CBCDR_RAW   ((reg_t*)0x400FC014u)

typedef volatile struct {
	reg_t					 : 4;
	reg_t lpspi_clk_sel		 : 2;
	reg_t					 : 2;
	reg_t flexspi2_clk_sel	 : 2;
	reg_t					 : 2;
	reg_t periph_clk2_sel	 : 2;
	reg_t trace_clk_sel		 : 2;
	reg_t					 : 2;
	reg_t pre_periph_clk_sel : 2;
	reg_t					 : 3;
	reg_t lcdif_podf		 : 3;
	reg_t lpspi_podf		 : 3;
	reg_t flexspi2_podf		 : 3;
} CCM_CBCMR_t;
#define CCM_CBCMR       ((CCM_CBCMR_t*)0x400FC018u)
#define CCM_CBCMR_RAW   ((reg_t*)0x400FC018u)

typedef volatile struct {
	reg_t perclk_podf	  : 6;
	reg_t perclk_clk_sel  : 1;
	reg_t				  : 3;
	reg_t sai1_clk_sel	  : 2;
	reg_t sai2_clk_sel	  : 2;
	reg_t sai3_clk_sel	  : 2;
	reg_t usdhc1_clk_sel  : 1;
	reg_t usdhc2_clk_sel  : 1;
	reg_t				  : 5;
	reg_t flexspi_podf	  : 3;
	reg_t				  : 3;
	reg_t flexspi_clk_sel : 2;
	reg_t				  : 1;
} CCM_CSCMR1_t;
#define CCM_CSCMR1      ((CCM_CSCMR1_t*)0x400FC01Cu)
#define CCM_CSCMR1_RAW  ((reg_t*)0x400FC01Cu)

typedef volatile struct {
	reg_t				  : 2;
	reg_t can_clk_podf	  : 6;
	reg_t can_clk_sel	  : 2;
	reg_t				  : 9;
	reg_t flexio2_clk_sel : 2;
	reg_t				  : 11;
} CCM_CSCMR2_t;
#define CCM_CSCMR2      ((CCM_CSCMR2_t*)0x400FC020u)
#define CCM_CSCMR2_RAW  ((reg_t*)0x400FC020u)

typedef volatile struct {
	reg_t uart_clk_podf : 6;
	reg_t uart_clk_sel	: 1;
	reg_t				: 4;
	reg_t usdhc1_podf	: 3;
	reg_t				: 2;
	reg_t usdhc2_podf	: 3;
	reg_t				: 6;
	reg_t trace_podf	: 2;
	reg_t				: 5;
} CCM_CSCDR1_t;
#define CCM_CSCDR1      ((CCM_CSCDR1_t*)0x400FC024u)
#define CCM_CSCDR1_RAW  ((reg_t*)0x400FC024u)

typedef volatile struct {
	reg_t sai1_clk_podf	   : 6;
	reg_t sai1_clk_pred	   : 3;
	reg_t flexio2_clk_pred : 3;
	reg_t				   : 4;
	reg_t sai3_clk_podf	   : 6;
	reg_t sai3_clk_pred	   : 3;
	reg_t flexio2_clk_podf : 3;
	reg_t				   : 4;
} CCM_CS1CDR_t;
#define CCM_CS1CDR      ((CCM_CS1CDR_t*)0x400FC028u)
#define CCM_CS1CDR_RAW  ((reg_t*)0x400FC028u)

typedef volatile struct {
	reg_t sai2_clk_podf : 6;
	reg_t sai2_clk_pred : 3;
	reg_t				: 23;
} CCM_CS2CDR_t;
#define CCM_CS2CDR      ((CCM_CS2CDR_t*)0x400FC02Cu)
#define CCM_CS2CDR_RAW  ((reg_t*)0x400FC02Cu)

typedef volatile struct {
	reg_t				   : 7;
	reg_t flexio1_clk_sel  : 2;
	reg_t flexio1_clk_podf : 3;
	reg_t flexio1_clk_pred : 3;
	reg_t				   : 5;
	reg_t spdif0_clk_sel   : 2;
	reg_t spdif0_clk_podf  : 3;
	reg_t spdif0_clk_pred  : 3;
	reg_t				   : 4;
} CCM_CDCDR_t;
