Pandabear1125/tycore/src/imxrt_regmap.h
#define CCM_CDCDR       ((CCM_CDCDR_t*)0x400FC030u)
#define CCM_CDCDR_RAW   ((reg_t*)0x400FC030u)

typedef volatile struct {
	reg_t					: 12;
	reg_t lcdif_pred		: 3;
	reg_t lcdif_pre_clk_sel : 3;
	reg_t lpi2c_clk_sel		: 1;
	reg_t lpi2c_clk_podf	: 6;
	reg_t					: 7;
} CCM_CSCDR2_t;
#define CCM_CSCDR2      ((CCM_CSCDR2_t*)0x400FC038u)
#define CCM_CSCDR2_RAW  ((reg_t*)0x400FC038u)

typedef volatile struct {
	reg_t			  : 9;
	reg_t csi_clk_sel : 2;
	reg_t csi_podf	  : 3;
	reg_t			  : 18;
} CCM_CSCDR3_t;
#define CCM_CSCDR3      ((CCM_CSCDR3_t*)0x400FC03Cu)
#define CCM_CSCDR3_RAW  ((reg_t*)0x400FC03Cu)

typedef volatile struct {
	reg_t semc_podf_busy	   : 1;
	reg_t ahb_podf_busy		   : 1;
	reg_t					   : 1;
	reg_t periph2_clk_sel_busy : 1;
	reg_t					   : 1;
	reg_t periph_clk_sel_busy  : 1;
	reg_t					   : 10;
	reg_t arm_podf_busy		   : 1;
	reg_t					   : 15;
} CCM_CDHIPR_t;
#define CCM_CDHIPR      ((CCM_CDHIPR_t*)0x400FC048u)
#define CCM_CDHIPR_RAW  ((reg_t*)0x400FC048u)

typedef volatile struct {
	reg_t lpm				 : 2;
	reg_t					 : 3;
	reg_t arm_clk_dis_on_lpm : 1;
	reg_t sbyos				 : 1;
	reg_t dis_ref_osc		 : 1;
	reg_t vstby				 : 1;
	reg_t stby_count		 : 2;
	reg_t cosc_pwrdown		 : 1;
	reg_t					 : 7;
	reg_t bypass_lpm_hs1	 : 1;
	reg_t					 : 1;
	reg_t bypass_lpm_hs0	 : 1;
	reg_t mask_core0_wfi	 : 1;
	reg_t					 : 3;
	reg_t mask_scu_idle		 : 1;
	reg_t mask_l2cc_idle	 : 1;
	reg_t					 : 4;
} CCM_CLPCR_t;
#define CCM_CLPCR       ((CCM_CLPCR_t*)0x400FC054u)
#define CCM_CLPCR_RAW   ((reg_t*)0x400FC054u)

typedef volatile struct {
	reg_t lrf_pll				 : 1;
	reg_t						 : 5;
	reg_t cosc_ready			 : 1;
	reg_t						 : 10;
	reg_t semc_podf_loaded		 : 1;
	reg_t						 : 1;
	reg_t periph2_clk_sel_loaded : 1;
	reg_t ahb_podf_loaded		 : 1;
	reg_t						 : 1;
	reg_t periph_clk_sel_loaded	 : 1;
	reg_t						 : 3;
	reg_t arm_podf_loaded		 : 1;
	reg_t						 : 5;
} CCM_CISR_t;
#define CCM_CISR        ((CCM_CISR_t*)0x400FC058u)
#define CCM_CISR_RAW    ((reg_t*)0x400FC058u)

typedef volatile struct {
	reg_t mask_lrf_pll				  : 1;
	reg_t							  : 5;
	reg_t mask_cosc_ready			  : 1;
	reg_t							  : 10;
	reg_t mask_semc_podf_loaded		  : 1;
	reg_t							  : 1;
	reg_t mask_periph2_clk_sel_loaded : 1;
	reg_t mask_ahb_podf_loaded		  : 1;
	reg_t							  : 1;
	reg_t mask_periph_clk_sel_loaded  : 1;
	reg_t							  : 3;
	reg_t arm_podf_loaded			  : 1;
	reg_t							  : 5;
} CCM_CIMR_t;
#define CCM_CIMR        ((CCM_CIMR_t*)0x400FC05Cu)
#define CCM_CIMR_RAW    ((reg_t*)0x400FC05Cu)

typedef volatile struct {
	reg_t clko1_sel : 4;
	reg_t clko1_div : 4;
	reg_t clko1_en	: 1;
	reg_t			: 7;
	reg_t clko2_sel : 5;
	reg_t clko2_div : 3;
	reg_t clko2_en	: 1;
	reg_t			: 7;
} CCM_CCOSR_t;
#define CCM_CCOSR       ((CCM_CCOSR_t*)0x400FC060u)
#define CCM_CCOSR_RAW   ((reg_t*)0x400FC060u)

typedef volatile struct {
	reg_t pmic_delay_scalar		 : 1;
	reg_t						 : 3;
	reg_t efuse_prog_supply_gate : 1;
	reg_t						 : 9;
	reg_t sys_mem_ds_ctrl		 : 2;
	reg_t fpl					 : 1;
	reg_t int_mem_clk_lpm		 : 1;
	reg_t						 : 14;
} CCM_CGPR_t;
#define CCM_CGPR        ((CCM_CGPR_t*)0x400FC064u)
#define CCM_CGPR_RAW    ((reg_t*)0x400FC064u)

// Clock is off during all modes. Stop enter hardware handshake is disabled.
#define CGR_OFF (0x0u)
// Clock is on during run mode, but off in WAIT and STOP modes.
#define CGR_RUN (0x1u)
// 0x2 is reserved.
// Clock is on during all modes, except STOP mode.
#define CGR_ON  (0x3u)

// Clock Gating Register (CCGR) Bit Masks
#define CCM_CGn(n)  (0x3 << (n * 2))

typedef volatile struct {
	reg_t aips_tz1_clk_enable	 : 2;
	reg_t aips_tz2_clk_enable	 : 2;
	reg_t mqs_hmclk_clock_enable : 2;
	reg_t						 : 2;
	reg_t sim_m_mainclk_r_enable : 2;
	reg_t dcp_clk_enable		 : 2;
	reg_t lpuart3_clk_enable	 : 2;
	reg_t can1_clk_enable		 : 2;
	reg_t can1_serial_clk_enable : 2;
	reg_t can2_clk_enable		 : 2;
	reg_t can2_serial_clk_enable : 2;
	reg_t trace_clk_enable		 : 2;
	reg_t gpt2_bus_clk_enable	 : 2;
	reg_t gpt2_serial_clk_enable : 2;
	reg_t lpuart2_clk_enable	 : 2;
	reg_t gpio2_clk_enable		 : 2;
} CCM_CCGR0_t;
#define CCM_CCGR0       ((CCM_CCGR0_t*)0x400FC068u)
#define CCM_CCGR0_RAW   ((reg_t*)0x400FC068u)

typedef volatile struct {
	reg_t lpspi1_clk_enable		: 2;
	reg_t lpspi2_clk_enable		: 2;
	reg_t lpspi3_clk_enable		: 2;
	reg_t lpspi4_clk_enable		: 2;
	reg_t adc2_clk_enable		: 2;
	reg_t enet_clk_enable		: 2;
	reg_t pit_clk_enable		: 2;
	reg_t aoi2_clk_enable		: 2;
	reg_t adc1_clk_enable		: 2;
	reg_t semc_exsc_clk_enable	: 2;
	reg_t gpt_clk_enable		: 2;
	reg_t gpt_serial_clk_enable : 2;
	reg_t lpuart4_clk_enable	: 2;
	reg_t gpio1_clk_enable		: 2;
	reg_t csu_clk_enable		: 2;
	reg_t gpio5_clk_enable		: 2;
} CCM_CCGR1_t;
#define CCM_CCGR1       ((CCM_CCGR1_t*)0x400FC06Cu)
#define CCM_CCGR1_RAW   ((reg_t*)0x400FC06Cu)

typedef volatile struct {
	reg_t ocram_exsc_clk_enable	 : 2;
	reg_t csi_clk_enable		 : 2;
	reg_t iomuxc_snvs_clk_enable : 2;
	reg_t lpi2c1_clk_enable		 : 2;
	reg_t lpi2c2_clk_enable		 : 2;
	reg_t lpi2c3_clk_enable		 : 2;
	reg_t ocotp_clk_enable		 : 2;
	reg_t xbar3_clk_enable		 : 2;
	reg_t ipmux1_clk_enable		 : 2;
	reg_t ipmux2_clk_enable		 : 2;
	reg_t ipmux3_clk_enable		 : 2;
	reg_t xbar1_clk_enable		 : 2;
	reg_t xbar2_clk_enable		 : 2;
	reg_t gpio3_clk_enable		 : 2;
	reg_t lcd_clk_enable		 : 2;
	reg_t pxp_clk_enable		 : 2;
} CCM_CCGR2_t;
#define CCM_CCGR2       ((CCM_CCGR2_t*)0x400FC070u)
#define CCM_CCGR2_RAW   ((reg_t*)0x400FC070u)

typedef volatile struct {
	reg_t flexio2_clk_enable		 : 2;
	reg_t lpuart5_clk_enable		 : 2;
	reg_t semc_clk_enable			 : 2;
	reg_t lpuart6_clk_enable		 : 2;
	reg_t aoi1_clk_enable			 : 2;
	reg_t lcdif_pix_clk_enable		 : 2;
	reg_t gpio4_clk_enable			 : 2;
	reg_t ewm_clk_enable			 : 2;
	reg_t wdog1_clk_enable			 : 2;
	reg_t flexram_clk_enable		 : 2;
	reg_t acmp1_clk_enable			 : 2;
	reg_t acmp2_clk_enable			 : 2;
	reg_t acmp3_clk_enable			 : 2;
	reg_t acmp4_clk_enable			 : 2;
	reg_t ocram_clk_enable			 : 2;
	reg_t iomuxc_snvs_gpr_clk_enable : 2;
} CCM_CCGR3_t;
#define CCM_CCGR3       ((CCM_CCGR3_t*)0x400FC074u)
#define CCM_CCGR3_RAW   ((reg_t*)0x400FC074u)

typedef volatile struct {
	reg_t sim_m7_mainclk_r_enable : 2;
	reg_t iomuxc_clk_enable		  : 2;
	reg_t iomuxc_gpr_clk_enable	  : 2;
	reg_t bee_clk_enable		  : 2;
	reg_t sim_m7_clk_enable		  : 2;
	reg_t tsc_clk_enable		  : 2;
	reg_t sim_m_clk_enable		  : 2;
	reg_t sim_ems_clk_enable	  : 2;
	reg_t pwm1_clk_enable		  : 2;
	reg_t pwm2_clk_enable		  : 2;
	reg_t pwm3_clk_enable		  : 2;
	reg_t pwm4_clk_enable		  : 2;
	reg_t qdc1_clk_enable		  : 2;
	reg_t qdc2_clk_enable		  : 2;
	reg_t qdc3_clk_enable		  : 2;
	reg_t qdc4_clk_enable		  : 2;
} CCM_CCGR4_t;
#define CCM_CCGR4       ((CCM_CCGR4_t*)0x400FC078u)
#define CCM_CCGR4_RAW   ((reg_t*)0x400FC078u)

typedef volatile struct {
	reg_t rom_clk_enable	  : 2;
	reg_t flexio1_clk_enable  : 2;
	reg_t wdog3_clk_enable	  : 2;
	reg_t dma_clk_enable	  : 2;
	reg_t kpp_clk_enable	  : 2;
	reg_t wdog2_clk_enable	  : 2;
	reg_t aips_tz4_clk_enable : 2;
	reg_t spdif_clk_enable	  : 2;
	reg_t sim_main_clk_enable : 2;
	reg_t sai1_clk_enable	  : 2;
	reg_t sai2_clk_enable	  : 2;
	reg_t sai3_clk_enable	  : 2;
	reg_t lpuart1_clk_enable  : 2;
	reg_t lpuart7_clk_enable  : 2;
	reg_t snvs_hp_clk_enable  : 2;
	reg_t snvs_lp_clk_enable  : 2;
} CCM_CCGR5_t;
