Pandabear1125/tycore/src/imxrt_regmap.h
#define CCM_CCGR5       ((CCM_CCGR5_t*)0x400FC07Cu)
#define CCM_CCGR5_RAW   ((reg_t*)0x400FC07Cu)

typedef volatile struct {
	reg_t usboh3_clk_enable	  : 2;
	reg_t usdhc1_clk_enable	  : 2;
	reg_t usdhc2_clk_enable	  : 2;
	reg_t dcdc_clk_enable	  : 2;
	reg_t ipmux4_clk_enable	  : 2;
	reg_t flexspi_clk_enable  : 2;
	reg_t trng_clk_enable	  : 2;
	reg_t lpuart8_clk_enable  : 2;
	reg_t timer4_clk_enable	  : 2;
	reg_t aips_tz3_clk_enable : 2;
	reg_t sim_per_clk_enable  : 2;
	reg_t anadig_clk_enable	  : 2;
	reg_t lpi2c4_clk_enable	  : 2;
	reg_t timer1_clk_enable	  : 2;
	reg_t timer2_clk_enable	  : 2;
	reg_t timer3_clk_enable	  : 2;
} CCM_CCGR6_t;
#define CCM_CCGR6       ((CCM_CCGR6_t*)0x400FC080u)
#define CCM_CCGR6_RAW   ((reg_t*)0x400FC080u)

typedef volatile struct {
	reg_t enet2_clk_enable		 : 2;
	reg_t flexspi2_clk_enable	 : 2;
	reg_t axbs_l_clk_enable		 : 2;
	reg_t can3_clk_enable		 : 2;
	reg_t can3_serial_clk_enable : 2;
	reg_t apis_lite_clk_enable	 : 2;
	reg_t flexio3_clk_enable	 : 2;
	reg_t						 : 18;
} CCM_CCGR7_t;
#define CCM_CCGR7       ((CCM_CCGR7_t*)0x400FC084u)
#define CCM_CCGR7_RAW   ((reg_t*)0x400FC084u)

typedef volatile struct {
	reg_t					  : 5;
	reg_t mod_en_ov_gpt		  : 1;
	reg_t mod_em_ov_pit		  : 1;
	reg_t mod_en_usdhc		  : 1;
	reg_t					  : 1;
	reg_t mod_en_ov_trng	  : 1;
	reg_t mod_en_ov_canfd_cpi : 1;
	reg_t					  : 17;
	reg_t mod_en_ov_can2_cpi  : 1;
	reg_t					  : 1;
	reg_t mod_en_ov_can1_cpi  : 1;
	reg_t					  : 1;
} CCM_CMEOR_t;
#define CCM_CMEOR       ((CCM_CMEOR_t*)0x400FC088u)
#define CCM_CMEOR_RAW   ((reg_t*)0x400FC088u)

#pragma endregion  // CCM

// CCM Analog Memory Map/Register Definition
// RM 14.8

#pragma region CCM_ANALOG

typedef volatile struct {
	reg_t div_select	 : 7;
	reg_t				 : 5;
	reg_t powerdown		 : 1;
	reg_t enable		 : 1;
	reg_t bypass_clk_src : 2;
	reg_t bypass		 : 1;
	reg_t				 : 2;
	reg_t pll_sel		 : 1;
	reg_t				 : 11;
	reg_t lock			 : 1;
} CCM_ANALOG_PLL_ARM_t;
#define CCM_ANALOG_PLL_ARM          ((CCM_ANALOG_PLL_ARM_t*)0x400D8000u)
#define CCM_ANALOG_PLL_ARM_SET      ((CCM_ANALOG_PLL_ARM_t*)0x400D8004u)
#define CCM_ANALOG_PLL_ARM_CLR      ((CCM_ANALOG_PLL_ARM_t*)0x400D8008u)
#define CCM_ANALOG_PLL_ARM_TOG      ((CCM_ANALOG_PLL_ARM_t*)0x400D800Cu)
#define CCM_ANALOG_PLL_ARM_RAW      ((reg_t*)0x400D8000u)

typedef volatile struct {
	reg_t				 : 1;
	reg_t div_select	 : 1;
	reg_t				 : 4;
	reg_t en_usb_clks	 : 1;
	reg_t				 : 5;
	reg_t power			 : 1;
	reg_t enable		 : 1;
	reg_t bypass_clk_src : 2;
	reg_t bypass		 : 1;
	reg_t				 : 14;
	reg_t lock			 : 1;
} CCM_ANALOG_PLL_USB1_t;
#define CCM_ANALOG_PLL_USB1         ((CCM_ANALOG_PLL_USB1_t*)0x400D8010u)
#define CCM_ANALOG_PLL_USB1_SET     ((CCM_ANALOG_PLL_USB1_t*)0x400D8014u)
#define CCM_ANALOG_PLL_USB1_CLR     ((CCM_ANALOG_PLL_USB1_t*)0x400D8018u)
#define CCM_ANALOG_PLL_USB1_TOG     ((CCM_ANALOG_PLL_USB1_t*)0x400D801Cu)
#define CCM_ANALOG_PLL_USB1_RAW     ((reg_t*)0x400D8010u)

typedef volatile struct {
	reg_t				 : 1;
	reg_t div_select	 : 1;
	reg_t				 : 4;
	reg_t en_usb_clks	 : 1;
	reg_t				 : 5;
	reg_t power			 : 1;
	reg_t enable		 : 1;
	reg_t bypass_clk_src : 2;
	reg_t bypass		 : 1;
	reg_t				 : 14;
	reg_t lock			 : 1;
} CCM_ANALOG_PLL_USB2_t;
#define CCM_ANALOG_PLL_USB2         ((CCM_ANALOG_PLL_USB2_t*)0x400D8020u)
#define CCM_ANALOG_PLL_USB2_SET     ((CCM_ANALOG_PLL_USB2_t*)0x400D8024u)
#define CCM_ANALOG_PLL_USB2_CLR     ((CCM_ANALOG_PLL_USB2_t*)0x400D8028u)
#define CCM_ANALOG_PLL_USB2_TOG     ((CCM_ANALOG_PLL_USB2_t*)0x400D802Cu)
#define CCM_ANALOG_PLL_USB2_RAW     ((reg_t*)0x400D8020u)

typedef volatile struct {
	reg_t div_select	 : 1;
	reg_t				 : 11;
	reg_t powerdown		 : 1;
	reg_t enable		 : 1;
	reg_t bypass_clk_src : 2;
	reg_t bypass		 : 1;
	reg_t				 : 14;
	reg_t lock			 : 1;
} CCM_ANALOG_PLL_SYS_t;
#define CCM_ANALOG_PLL_SYS          ((CCM_ANALOG_PLL_SYS_t*)0x400D8030u)
#define CCM_ANALOG_PLL_SYS_SET      ((CCM_ANALOG_PLL_SYS_t*)0x400D8034u)
#define CCM_ANALOG_PLL_SYS_CLR      ((CCM_ANALOG_PLL_SYS_t*)0x400D8038u)
#define CCM_ANALOG_PLL_SYS_TOG      ((CCM_ANALOG_PLL_SYS_t*)0x400D803Cu)
#define CCM_ANALOG_PLL_SYS_RAW      ((reg_t*)0x400D8030u)

typedef volatile struct {
	reg_t step	 : 15;
	reg_t enable : 1;
	reg_t stop	 : 16;
} CCM_ANALOG_PLL_SYS_SS_t;
#define CCM_ANALOG_PLL_SYS_SS       ((CCM_ANALOG_PLL_SYS_SS_t*)0x400D8040u)
#define CCM_ANALOG_PLL_SYS_SS_RAW   ((reg_t*)0x400D8040u)

typedef volatile struct {
	reg_t numerator : 30;  // signed
	reg_t			: 2;
} CCM_ANALOG_PLL_SYS_NUM_t;
#define CCM_ANALOG_PLL_SYS_NUM      ((CCM_ANALOG_PLL_SYS_NUM_t*)0x400D8050u)
#define CCM_ANALOG_PLL_SYS_NUM_RAW  ((reg_t*)0x400D8050u)

typedef volatile struct {
	reg_t denominator : 30;	 // signed
	reg_t			  : 2;
} CCM_ANALOG_PLL_SYS_DENOM_t;
#define CCM_ANALOG_PLL_SYS_DENOM    ((CCM_ANALOG_PLL_SYS_DENOM_t*)0x400D8060u)
#define CCM_ANALOG_PLL_SYS_DENOM_RAW ((reg_t*)0x400D8060u)

typedef volatile struct {
	reg_t div_select	  : 7;
	reg_t				  : 5;
	reg_t powerdown		  : 1;
	reg_t enable		  : 1;
	reg_t bypass_clk_src  : 2;
	reg_t bypass		  : 1;
	reg_t				  : 2;
	reg_t post_div_select : 2;
	reg_t				  : 10;
	reg_t lock			  : 1;
} CCM_ANALOG_PLL_AUDIO_t;
#define CCM_ANALOG_PLL_AUDIO        ((CCM_ANALOG_PLL_AUDIO_t*)0x400D8070u)
#define CCM_ANALOG_PLL_AUDIO_SET    ((CCM_ANALOG_PLL_AUDIO_t*)0x400D8074u)
#define CCM_ANALOG_PLL_AUDIO_CLR    ((CCM_ANALOG_PLL_AUDIO_t*)0x400D8078u)
#define CCM_ANALOG_PLL_AUDIO_TOG    ((CCM_ANALOG_PLL_AUDIO_t*)0x400D807Cu)
#define CCM_ANALOG_PLL_AUDIO_RAW    ((reg_t*)0x400D8070u)

typedef volatile struct {
	reg_t numerator : 30;  // signed
	reg_t			: 2;
} CCM_ANALOG_PLL_AUDIO_NUM_t;
#define CCM_ANALOG_PLL_AUDIO_NUM    ((CCM_ANALOG_PLL_AUDIO_NUM_t*)0x400D8080u)
#define CCM_ANALOG_PLL_AUDIO_NUM_RAW ((reg_t*)0x400D8080u)

typedef volatile struct {
	reg_t denominator : 30;	 // signed
	reg_t			  : 2;
} CCM_ANALOG_PLL_AUDIO_DENOM_t;
#define CCM_ANALOG_PLL_AUDIO_DENOM  ((CCM_ANALOG_PLL_AUDIO_DENOM_t*)0x400D8090u)
#define CCM_ANALOG_PLL_AUDIO_DENOM_RAW ((reg_t*)0x400D8090u)

typedef volatile struct {
	reg_t div_select	  : 7;
	reg_t				  : 5;
	reg_t powerdown		  : 1;
	reg_t enable		  : 1;
	reg_t bypass_clk_src  : 2;
	reg_t bypass		  : 1;
	reg_t				  : 2;
	reg_t post_div_select : 2;
	reg_t				  : 10;
	reg_t lock			  : 1;
} CCM_ANALOG_PLL_VIDEO_t;
#define CCM_ANALOG_PLL_VIDEO        ((CCM_ANALOG_PLL_VIDEO_t*)0x400D80A0u)
#define CCM_ANALOG_PLL_VIDEO_SET    ((CCM_ANALOG_PLL_VIDEO_t*)0x400D80A4u)
#define CCM_ANALOG_PLL_VIDEO_CLR    ((CCM_ANALOG_PLL_VIDEO_t*)0x400D80A8u)
#define CCM_ANALOG_PLL_VIDEO_TOG    ((CCM_ANALOG_PLL_VIDEO_t*)0x400D80ACu)
#define CCM_ANALOG_PLL_VIDEO_RAW    ((reg_t*)0x400D80A0u)

typedef volatile struct {
	reg_t numerator : 30;  // signed
	reg_t			: 2;
} CCM_ANALOG_PLL_VIDEO_NUM_t;
