Pandabear1125/tycore/src/imxrt_regmap.h
#define CCM_ANALOG_PLL_VIDEO_NUM    ((CCM_ANALOG_PLL_VIDEO_NUM_t*)0x400D80B0u)
#define CCM_ANALOG_PLL_VIDEO_NUM_RAW ((reg_t*)0x400D80B0u)

typedef volatile struct {
	reg_t denominator : 30;	 // signed
	reg_t			  : 2;
} CCM_ANALOG_PLL_VIDEO_DENOM_t;
#define CCM_ANALOG_PLL_VIDEO_DENOM  ((CCM_ANALOG_PLL_VIDEO_DENOM_t*)0x400D80C0u)
#define CCM_ANALOG_PLL_VIDEO_DENOM_RAW ((reg_t*)0x400D80C0u)

typedef volatile struct {
	reg_t div_select	   : 2;
	reg_t enet2_div_select : 2;
	reg_t				   : 8;
	reg_t powerdown		   : 1;
	reg_t enable		   : 1;
	reg_t bypass_clk_src   : 2;
	reg_t bypass		   : 1;
	reg_t				   : 3;
	reg_t enet2_ref_en	   : 1;
	reg_t enet_25m_ref_en  : 1;
	reg_t				   : 9;
	reg_t lock			   : 1;
} CCM_ANALOG_PLL_ENET_t;
#define CCM_ANALOG_PLL_ENET         ((CCM_ANALOG_PLL_ENET_t*)0x400D80E0u)
#define CCM_ANALOG_PLL_ENET_SET     ((CCM_ANALOG_PLL_ENET_t*)0x400D80E4u)
#define CCM_ANALOG_PLL_ENET_CLR     ((CCM_ANALOG_PLL_ENET_t*)0x400D80E8u)
#define CCM_ANALOG_PLL_ENET_TOG     ((CCM_ANALOG_PLL_ENET_t*)0x400D80ECu)
#define CCM_ANALOG_PLL_ENET_RAW     ((reg_t*)0x400D80E0u)

typedef volatile struct {
	reg_t pfd0_frac	   : 6;
	reg_t pfd0_stable  : 1;
	reg_t pfd0_clkgate : 1;
	reg_t pfd1_frac	   : 6;
	reg_t pfd1_stable  : 1;
	reg_t pfd1_clkgate : 1;
	reg_t pfd2_frac	   : 6;
	reg_t pfd2_stable  : 1;
	reg_t pfd2_clkgate : 1;
	reg_t pfd3_frac	   : 6;
	reg_t pfd3_stable  : 1;
	reg_t pfd3_clkgate : 1;
} CCM_ANALOG_PFD_480_t;
#define CCM_ANALOG_PFD_480          ((CCM_ANALOG_PFD_480_t*)0x400D80F0u)
#define CCM_ANALOG_PFD_480_SET      ((CCM_ANALOG_PFD_480_t*)0x400D80F4u)
#define CCM_ANALOG_PFD_480_CLR      ((CCM_ANALOG_PFD_480_t*)0x400D80F8u)
#define CCM_ANALOG_PFD_480_TOG      ((CCM_ANALOG_PFD_480_t*)0x400D80FCu)
#define CCM_ANALOG_PFD_480_RAW      ((reg_t*)0x400D80F0u)

typedef volatile struct {
	reg_t pfd0_frac	   : 6;
	reg_t pfd0_stable  : 1;
	reg_t pfd0_clkgate : 1;
	reg_t pfd1_frac	   : 6;
	reg_t pfd1_stable  : 1;
	reg_t pfd1_clkgate : 1;
	reg_t pfd2_frac	   : 6;
	reg_t pfd2_stable  : 1;
	reg_t pfd2_clkgate : 1;
	reg_t pfd3_frac	   : 6;
	reg_t pfd3_stable  : 1;
	reg_t pfd3_clkgate : 1;
} CCM_ANALOG_PFD_528_t;
#define CCM_ANALOG_PFD_528          ((CCM_ANALOG_PFD_528_t*)0x400D8100u)
#define CCM_ANALOG_PFD_528_SET      ((CCM_ANALOG_PFD_528_t*)0x400D8104u)
#define CCM_ANALOG_PFD_528_CLR      ((CCM_ANALOG_PFD_528_t*)0x400D8108u)
#define CCM_ANALOG_PFD_528_TOG      ((CCM_ANALOG_PFD_528_t*)0x400D810Cu)
#define CCM_ANALOG_PFD_528_RAW      ((reg_t*)0x400D8100u)

typedef volatile struct {
	reg_t reftop_pwd		 : 1;
	reg_t					 : 2;
	reg_t reftop_selfbiasoff : 1;
	reg_t reftop_vbgadj		 : 3;
	reg_t reftop_vbgup		 : 1;
	reg_t					 : 2;
	reg_t stop_mod_config	 : 2;
	reg_t discon_high_snvs	 : 1;
	reg_t osc_i				 : 2;
	reg_t osc_xtalok		 : 1;
	reg_t osc_xtalox_en		 : 1;
	reg_t					 : 8;
	reg_t clkgate_ctrl		 : 1;
	reg_t clkgate_delay		 : 3;
	reg_t rtc_xtal_source	 : 1;
	reg_t xtal_24m_pwd		 : 1;
	reg_t					 : 1;
} CCM_ANALOG_MISC0_t;
#define CCM_ANALOG_MISC0            ((CCM_ANALOG_MISC0_t*)0x400D8150u)
#define CCM_ANALOG_MISC0_SET        ((CCM_ANALOG_MISC0_t*)0x400D8154u)
#define CCM_ANALOG_MISC0_CLR        ((CCM_ANALOG_MISC0_t*)0x400D8158u)
#define CCM_ANALOG_MISC0_TOG        ((CCM_ANALOG_MISC0_t*)0x400D815Cu)
#define CCM_ANALOG_MISC0_RAW        ((reg_t*)0x400D8150u)

typedef volatile struct {
	reg_t lvds1_clk_sel		  : 5;
	reg_t					  : 5;
	reg_t lvdsclk1_oben		  : 1;
	reg_t					  : 1;
	reg_t lvdsclk1_iben		  : 1;
	reg_t					  : 3;
	reg_t pfd_480_autogate_en : 1;
	reg_t pfd_528_autogate_en : 1;
	reg_t					  : 9;
	reg_t irq_temppanic		  : 1;
	reg_t irq_templow		  : 1;
	reg_t irq_temphigh		  : 1;
	reg_t irq_ana_bo		  : 1;
	reg_t irq_dig_bo		  : 1;
} CCM_ANALOG_MISC1_t;
#define CCM_ANALOG_MISC1            ((CCM_ANALOG_MISC1_t*)0x400D8160u)
#define CCM_ANALOG_MISC1_SET        ((CCM_ANALOG_MISC1_t*)0x400D8164u)
#define CCM_ANALOG_MISC1_CLR        ((CCM_ANALOG_MISC1_t*)0x400D8168u)
#define CCM_ANALOG_MISC1_TOG        ((CCM_ANALOG_MISC1_t*)0x400D816Cu)
#define CCM_ANALOG_MISC1_RAW        ((reg_t*)0x400D8160u)

typedef volatile struct {
	reg_t reg0_bo_offset : 3;
	reg_t reg0_bo_status : 1;
	reg_t				 : 1;
	reg_t reg0_enable_bo : 1;
	reg_t reg0_ok		 : 1;
	reg_t pll3_disable	 : 1;
	reg_t reg1_bo_offset : 3;
	reg_t reg1_bo_status : 1;
	reg_t				 : 1;
	reg_t reg1_enable_bo : 1;
	reg_t reg1_ok		 : 1;
	reg_t audio_div_lsb	 : 1;
	reg_t reg2_bo_offset : 3;
	reg_t reg2_bo_status : 1;
	reg_t				 : 1;
	reg_t reg2_enable_bo : 1;
	reg_t reg2_ok		 : 1;
	reg_t audio_div_msb	 : 1;
	reg_t reg0_step_time : 2;
	reg_t reg1_step_time : 2;
	reg_t reg2_step_time : 2;
	reg_t video_div		 : 2;
} CCM_ANALOG_MISC2_t;
#define CCM_ANALOG_MISC2            ((CCM_ANALOG_MISC2_t*)0x400D8170u)
#define CCM_ANALOG_MISC2_SET        ((CCM_ANALOG_MISC2_t*)0x400D8174u)
#define CCM_ANALOG_MISC2_CLR        ((CCM_ANALOG_MISC2_t*)0x400D8178u)
#define CCM_ANALOG_MISC2_TOG        ((CCM_ANALOG_MISC2_t*)0x400D817Cu)
#define CCM_ANALOG_MISC2_RAW        ((reg_t*)0x400D8170u)

#pragma endregion  // CCM_ANALOG

#pragma endregion  // CCM_MODULE

// Power Management Unit (PMU) Module
// RM 16

#pragma region PMU_MODULE

typedef volatile struct {
	reg_t enable_linreg		 : 1;
	reg_t enable_bo			 : 1;
	reg_t enable_ilimit		 : 1;
	reg_t enable_pulldown	 : 1;
	reg_t bo_offset			 : 3;
	reg_t					 : 1;
	reg_t output_trg		 : 5;
	reg_t					 : 3;
	reg_t bo_vdd1p1			 : 1;
	reg_t ok_vdd1p1			 : 1;
	reg_t enable_weak_linreg : 1;
	reg_t selref_weak_linreg : 1;
	reg_t					 : 12;
} PMU_REG_1P1_t;
#define PMU_REG_1P1         ((PMU_REG_1P1_t*)0x400D8110u)
#define PMU_REG_1P1_SET     ((PMU_REG_1P1_t*)0x400D8114u)
#define PMU_REG_1P1_CLR     ((PMU_REG_1P1_t*)0x400D8118u)
#define PMU_REG_1P1_TOG     ((PMU_REG_1P1_t*)0x400D811Cu)
#define PMU_REG_1P1_RAW     ((reg_t*)0x400D8110u)

typedef volatile struct {
	reg_t enable_linreg : 1;
	reg_t enable_bo		: 1;
	reg_t enable_ilimit : 1;
	reg_t				: 1;
	reg_t bo_offset		: 3;
	reg_t vbus_sel		: 1;
	reg_t output_trg	: 5;
	reg_t				: 3;
	reg_t bo_vdd3p0		: 1;
	reg_t ok_vdd3p0		: 1;
	reg_t				: 14;
} PMU_REG_3P0_t;
#define PMU_REG_3P0         ((PMU_REG_3P0_t*)0x400D8120u)
#define PMU_REG_3P0_SET     ((PMU_REG_3P0_t*)0x400D8124u)
#define PMU_REG_3P0_CLR     ((PMU_REG_3P0_t*)0x400D8128u)
#define PMU_REG_3P0_TOG     ((PMU_REG_3P0_t*)0x400D812Cu)
#define PMU_REG_3P0_RAW     ((reg_t*)0x400D8120u)

typedef volatile struct {
	reg_t enable_linreg		 : 1;
	reg_t enable_bo			 : 1;
	reg_t enable_ilimit		 : 1;
	reg_t enable_pulldown	 : 1;
	reg_t bo_offset			 : 3;
	reg_t					 : 1;
	reg_t output_trg		 : 5;
	reg_t					 : 3;
	reg_t bo_vdd2p5			 : 1;
	reg_t ok_vdd2p5			 : 1;
	reg_t enable_weak_linreg : 1;
	reg_t					 : 13;
} PMU_REG_2P5_t;
#define PMU_REG_2P5         ((PMU_REG_2P5_t*)0x400D8130u)
#define PMU_REG_2P5_SET     ((PMU_REG_2P5_t*)0x400D8134u)
#define PMU_REG_2P5_CLR     ((PMU_REG_2P5_t*)0x400D8138u)
#define PMU_REG_2P5_TOG     ((PMU_REG_2P5_t*)0x400D813Cu)
#define PMU_REG_2P5_RAW     ((reg_t*)0x400D8130u)

typedef volatile struct {
	reg_t reg0_targ	 : 5;
	reg_t reg0_adj	 : 4;
	reg_t reg1_targ	 : 5;
	reg_t reg1_adj	 : 4;
	reg_t reg2_targ	 : 5;
	reg_t reg2_adj	 : 4;
	reg_t ramp_rate	 : 2;
	reg_t fet_odrive : 1;
	reg_t			 : 2;
} PMU_REG_CORE_t;
#define PMU_REG_CORE        ((PMU_REG_CORE_t*)0x400D8140u)
#define PMU_REG_CORE_SET    ((PMU_REG_CORE_t*)0x400D8144u)
#define PMU_REG_CORE_CLR    ((PMU_REG_CORE_t*)0x400D8148u)
#define PMU_REG_CORE_TOG    ((PMU_REG_CORE_t*)0x400D814Cu)
#define PMU_REG_CORE_RAW    ((reg_t*)0x400D8140u)

typedef volatile struct {
	reg_t reftop_pwd		 : 1;
	reg_t reftop_pwdvbgup	 : 1;
	reg_t reftop_lowpower	 : 1;
	reg_t reftop_selfbiasoff : 1;
	reg_t reftop_vbgadj		 : 3;
	reg_t reftop_vbgup		 : 1;
	reg_t					 : 2;
	reg_t stop_mode_config	 : 2;
	reg_t discon_high_snvs	 : 1;
	reg_t osc_i				 : 2;
	reg_t osc_xtalok		 : 1;
	reg_t osc_xtalok_en		 : 1;
	reg_t					 : 8;
	reg_t clkgate_ctrl		 : 1;
	reg_t clkgate_delay		 : 3;
	reg_t rtc_xtal_source	 : 1;
	reg_t xtal_24m_pwd		 : 1;
	reg_t vid_pll_prediv	 : 1;
} PMU_MISC0_t;
#define PMU_MISC0           ((PMU_MISC0_t*)0x400D8150u)
#define PMU_MISC0_SET       ((PMU_MISC0_t*)0x400D8154u)
#define PMU_MISC0_CLR       ((PMU_MISC0_t*)0x400D8158u)
#define PMU_MISC0_TOG       ((PMU_MISC0_t*)0x400D815Cu)
#define PMU_MISC0_RAW       ((reg_t*)0x400D8150u)

typedef volatile struct {
	reg_t lvds1_clk_sel		  : 5;
	reg_t lvds2_clk_sel		  : 5;
	reg_t lvdsclk1_oben		  : 1;
	reg_t lvdsclk2_oben		  : 1;
	reg_t lvdsclk1_iben		  : 1;
	reg_t lvdsclk2_iben		  : 1;
	reg_t					  : 2;
	reg_t pfd_480_autogate_en : 1;
	reg_t pfd_528_autogate_en : 1;
	reg_t					  : 9;
	reg_t irq_temppanic		  : 1;
	reg_t irq_templow		  : 1;
	reg_t irq_temphigh		  : 1;
	reg_t irq_ana_bo		  : 1;
	reg_t irq_dig_bo		  : 1;
} PMU_MISC1_t;
#define PMU_MISC1           ((PMU_MISC1_t*)0x400D8160u)
#define PMU_MISC1_SET       ((PMU_MISC1_t*)0x400D8164u)
#define PMU_MISC1_CLR       ((PMU_MISC1_t*)0x400D8168u)
#define PMU_MISC1_TOG       ((PMU_MISC1_t*)0x400D816Cu)
#define PMU_MISC1_RAW       ((reg_t*)0x400D8160u)

typedef volatile struct {
	reg_t reg0_bo_offset : 3;
	reg_t reg0_bo_status : 1;
	reg_t				 : 1;
	reg_t reg0_enable_bo : 1;
	reg_t				 : 1;
	reg_t pll3_disable	 : 1;
	reg_t reg1_bo_offset : 3;
	reg_t reg1_bo_status : 1;
	reg_t				 : 1;
	reg_t reg1_enable_bo : 1;
	reg_t				 : 1;
	reg_t audio_div_lsb	 : 1;
	reg_t reg2_bo_offset : 3;
	reg_t reg2_bo_status : 1;
	reg_t				 : 1;
	reg_t reg2_enable_bo : 1;
	reg_t reg2_ok		 : 1;
	reg_t audio_div_msb	 : 1;
	reg_t reg0_step_time : 2;
	reg_t reg1_step_time : 2;
	reg_t reg2_step_time : 2;
	reg_t video_div		 : 2;
} PMU_MISC2_t;
