Pandabear1125/tycore/src/imxrt_regmap.h
#define PMU_MISC2           ((PMU_MISC2_t*)0x400D8170u)
#define PMU_MISC2_SET       ((PMU_MISC2_t*)0x400D8174u)
#define PMU_MISC2_CLR       ((PMU_MISC2_t*)0x400D8178u)
#define PMU_MISC2_TOG       ((PMU_MISC2_t*)0x400D817Cu)
#define PMU_MISC2_RAW       ((reg_t*)0x400D8170u)

#pragma endregion  // PMU_MODULE

// DCDC Converter Module
// RM 18

#pragma region DCDC_MODULE

// DCDC Memory Map/Register Descriptions
// RM 18.5.1

typedef volatile struct {
	reg_t pwd_zcd				  : 1;
	reg_t disable_auto_clk_switch : 1;
	reg_t sel_clk				  : 1;
	reg_t pwd_osc_int			  : 1;
	reg_t pwd_cur_sns_cmp		  : 1;
	reg_t cur_sns_thrsh			  : 3;
	reg_t pwd_overcur_det		  : 1;
	reg_t overcur_trig_adj		  : 2;
	reg_t pwd_cmp_batt_det		  : 1;
	reg_t						  : 4;
	reg_t en_lp_overload_sns	  : 1;
	reg_t pwd_high_volt_det		  : 1;
	reg_t lp_overload_thrsh		  : 2;
	reg_t lp_overload_freq_sel	  : 1;
	reg_t lp_high_hys			  : 1;
	reg_t						  : 4;
	reg_t pwd_cmp_offset		  : 1;
	reg_t xtalok_disable		  : 1;
	reg_t current_alert_reset	  : 1;
	reg_t xtal_24m_ok			  : 1;
	reg_t						  : 1;
	reg_t sts_dc_ok				  : 1;
} DCDC_REG0_t;
#define DCDC_REG0       ((DCDC_REG0_t*)0x40080000u)
#define DCDC_REG0_RAW   ((reg_t*)0x40080000u)

typedef volatile struct {
	reg_t					  : 7;
	reg_t reg_fbk_sel		  : 2;
	reg_t reg_rload_sw		  : 1;
	reg_t					  : 2;
	reg_t lp_cmp_isrc_sel	  : 2;
	reg_t					  : 7;
	reg_t loopctrl_hst_thresh : 1;
	reg_t					  : 1;
	reg_t loopctrl_en_hyst	  : 1;
	reg_t vbg_trim			  : 5;
	reg_t					  : 3;
} DCDC_REG1_t;
#define DCDC_REG1       ((DCDC_REG1_t*)0x40080004u)
#define DCDC_REG1_RAW   ((reg_t*)0x40080004u)

typedef volatile struct {
	reg_t						: 6;
	reg_t loopctrl_dc_ff		: 3;
	reg_t loopctrl_en_rcscale	: 3;
	reg_t loopctrl_rscale_thrsh : 1;
	reg_t loopctrl_hyst_sign	: 1;
	reg_t						: 13;
	reg_t disable_pulse_skip	: 1;
	reg_t dcm_set_ctrl			: 1;
	reg_t						: 3;
} DCDC_REG2_t;
#define DCDC_REG2       ((DCDC_REG2_t*)0x40080008u)
#define DCDC_REG2_RAW   ((reg_t*)0x40080008u)

typedef volatile struct {
	reg_t trg				: 5;
	reg_t					: 3;
	reg_t target_lp			: 3;
	reg_t					: 13;
	reg_t minpwr_dc_halfclk : 1;
	reg_t					: 5;
	reg_t disable_step		: 1;
	reg_t					: 1;
} DCDC_REG3_t;
#define DCDC_REG3       ((DCDC_REG3_t*)0x4008000Cu)
#define DCDC_REG3_RAW   ((reg_t*)0x4008000Cu)

#pragma endregion  // DCDC_MODULE

// ARMv7-M Architecture
// AM B3.2.2

#pragma region ARM_ARCH

// 0xE000E000-0xE000E00F 	Includes the Interrupt Controller Type and Auxiliary Control registers

typedef volatile struct {
	reg_t intlinesnum : 4;
	reg_t			  : 28;
} SCS_ICTR_t;
#define SCS_ICTR 			((SCS_ICTR_t*)0xE000E004u)
#define SCS_ICTR_RAW 		((reg_t*)0xE000E004u)

typedef volatile struct {
	reg_t unknown : 32;	 // TODO: vendor defined
} SCS_ACTLR_t;
#define SCS_ACTLR 			((SCS_ACTLR_t*)0xE000E008u)
#define SCS_ACTLR_RAW 		((reg_t*)0xE000E008u)

// 0xE000E010-0xE000E0FF 	System Timer

typedef volatile struct {
	reg_t enable : 1;
	reg_t tickint : 1;
	reg_t clksource : 1;
	reg_t : 13;
	reg_t countflag : 1;
	reg_t : 15;
} SCS_SYST_CSR_t;
#define SCS_SYST_CSR 		((SCS_SYST_CSR_t*)0xE000E010u)
#define SCS_SYST_CSR_RAW 	((reg_t*)0xE000E010u)

typedef volatile struct {
	reg_t reload : 24;
	reg_t : 8;
} SCS_SYST_RVR_t;
#define SCS_SYST_RVR 		((SCS_SYST_RVR_t*)0xE000E014u)
#define SCS_SYST_RVR_RAW 	((reg_t*)0xE000E014u)

typedef volatile struct {
	reg_t current : 32;
} SCS_SYST_CVR_t;
#define SCS_SYST_CVR 		((SCS_SYST_CVR_t*)0xE000E018u)
#define SCS_SYST_CVR_RAW 	((reg_t*)0xE000E018u)

typedef volatile struct {
	reg_t tenms : 24;
	reg_t : 5;
	reg_t skew : 1;
	reg_t noref : 1;
} SCS_SYST_CALIB_t;
#define SCS_SYST_CALIB 		((SCS_SYST_CALIB_t*)0xE000E01Cu)
#define SCS_SYST_CALIB_RAW 	((reg_t*)0xE000E01Cu)

// 0xE000E100-0xE000ECFF 	External interrupt controller

typedef volatile struct {
	reg_t setena : 32;
} SCS_NVIC_ISER_t;
// 0 <= n < 16
#define SCS_NVIC_ISER(n) 	((SCS_NVIC_ISER_t*)(0xE000E100u + (n) * 0x4))
#define SCS_NVIC_ISER_RAW(n) ((reg_t*)(0xE000E100u + (n) * 0x4))

typedef volatile struct {
	reg_t clrena : 32;
} SCS_NVIC_ICER_t;
// 0 <= n < 16
#define SCS_NVIC_ICER(n) 	((SCS_NVIC_ICER_t*)(0xE000E180u + (n) * 0x4))
#define SCS_NVIC_ICER_RAW(n) ((reg_t*)(0xE000E180u + (n) * 0x4))

typedef volatile struct {
	reg_t setpend : 32;
} SCS_NVIC_ISPR_t;
// 0 <= n < 16
#define SCS_NVIC_ISPR(n) 	((SCS_NVIC_ISPR_t*)(0xE000E200u + (n) * 0x4))
#define SCS_NVIC_ISPR_RAW(n) ((reg_t*)(0xE000E200u + (n) * 0x4))

typedef volatile struct {
	reg_t clrpend : 32;
} SCS_NVIC_ICPR_t;
// 0 <= n < 16
#define SCS_NVIC_ICPR(n) 	((SCS_NVIC_ICPR_t*)(0xE000E280u + (n) * 0x4))
#define SCS_NVIC_ICPR_RAW(n) ((reg_t*)(0xE000E280u + (n) * 0x4))

typedef volatile struct {
	reg_t active : 32;
} SCS_NVIC_IABR_t;
// 0 <= n < 16
#define SCS_NVIC_IABR(n) 	((SCS_NVIC_IABR_t*)(0xE000E300u + (n) * 0x4))
#define SCS_NVIC_IABR_RAW(n) ((reg_t*)(0xE000E300u + (n) * 0x4))

typedef volatile struct {
	reg_t pri0 : 8;
	reg_t pri1 : 8;
	reg_t pri2 : 8;
	reg_t pri3 : 8;
} SCS_NVIC_IPR_t;
// 0 <= n < 124
#define SCS_NVIC_IPR(n) 	((SCS_NVIC_IPR_t*)(0xE000E400u + (n) * 0x4))
#define SCS_NVIC_IPR_RAW(n) ((reg_t*)(0xE000E400u + (n) * 0x4))

// 0xE000ED00-0xE000ED8F 	System Control Block (SCB)

typedef volatile struct {
	reg_t revision	  : 4;
	reg_t partno	  : 12;
	reg_t arch		  : 4;	// reads as 0xf
	reg_t variant	  : 4;
	reg_t implementer : 8;
} SCB_CPUID_t;
#define SCB_CPUID 			((SCB_CPUID_t*)0xE000ED00u)
#define SCB_CPUID_RAW 		((reg_t*)0xE000ED00u)

typedef volatile struct {
	reg_t vectactive  : 9;
	reg_t			  : 2;
	reg_t rettobase	  : 1;
	reg_t vectpending : 9;
	reg_t			  : 1;
	reg_t isrpending  : 1;
	reg_t isrpreempt  : 1;
	reg_t			  : 1;
	reg_t pendstclr	  : 1;
	reg_t pendstset	  : 1;
	reg_t pendsvclr	  : 1;
	reg_t pendsvset	  : 1;
	reg_t			  : 2;
	reg_t nmipendset  : 1;
} SCB_ICSR_t;
#define SCB_ICSR 			((SCB_ICSR_t*)0xE000ED04u)
#define SCB_ICSR_RAW 		((reg_t*)0xE000ED04u)

typedef volatile struct {
	reg_t		 : 7;
	reg_t tbloff : 25;
} SCB_VTOR_t;
#define SCB_VTOR 			((SCB_VTOR_t*)0xE000ED08u)
#define SCB_VTOR_RAW 		((reg_t*)0xE000ED08u)

typedef volatile struct {
	reg_t vectreset		: 1;
	reg_t vectclractive : 1;
	reg_t sysresetreq	: 1;
	reg_t				: 5;
	reg_t prigroup		: 3;
	reg_t				: 4;
	reg_t endianness	: 1;
	reg_t vectkey		: 16;
} SCB_AIRCR_t;
#define SCB_AIRCR 			((SCB_AIRCR_t*)0xE000ED0Cu)
#define SCB_AIRCR_RAW 		((reg_t*)0xE000ED0Cu)

typedef volatile struct {
	reg_t			  : 1;
	reg_t sleeponexit : 1;
	reg_t sleepdeep	  : 1;
	reg_t			  : 1;
	reg_t sevonpend	  : 1;
	reg_t			  : 27;
} SCB_SCR_t;
