Pandabear1125/tycore/src/imxrt_regmap.h
#define SCB_SCR 			((SCB_SCR_t*)0xE000ED10u)
#define SCB_SCR_RAW 		((reg_t*)0xE000ED10u)

typedef volatile struct {
	reg_t nonbasethrdena : 1;
	reg_t ussersetmpend	 : 1;
	reg_t				 : 1;
	reg_t unalign_trp	 : 1;
	reg_t div_0_trp		 : 1;
	reg_t				 : 3;
	reg_t bfhfnmign		 : 1;
	reg_t stkalign		 : 1;
	reg_t				 : 6;
	reg_t dc			 : 1;
	reg_t ic			 : 1;
	reg_t bp			 : 1;
	reg_t				 : 13;
} SCB_CCR_t;
#define SCB_CCR 			((SCB_CCR_t*)0xE000ED14u)
#define SCB_CCR_RAW 		((reg_t*)0xE000ED14u)

typedef volatile struct {
	reg_t pri_4 : 8;
	reg_t pri_5 : 8;
	reg_t pri_6 : 8;
	reg_t pri_7 : 8;
} SCB_SHPR1_t;
#define SCB_SHPR1 			((SCB_SHPR1_t*)0xE000ED18u)
#define SCB_SHPR1_RAW 		((reg_t*)0xE000ED18u)

typedef volatile struct {
	reg_t pri_8	 : 8;
	reg_t pri_9	 : 8;
	reg_t pri_10 : 8;
	reg_t pri_11 : 8;
} SCB_SHPR2_t;
#define SCB_SHPR2 			((SCB_SHPR2_t*)0xE000ED1Cu)
#define SCB_SHPR2_RAW 		((reg_t*)0xE000ED1Cu)

typedef volatile struct {
	reg_t pri_12 : 8;
	reg_t pri_13 : 8;
	reg_t pri_14 : 8;
	reg_t pri_15 : 8;
} SCB_SHPR3_t;
#define SCB_SHPR3 			((SCB_SHPR3_t*)0xE000ED20u)
#define SCB_SHPR3_RAW 		((reg_t*)0xE000ED20u)

typedef volatile struct {
	reg_t memfaultact	 : 1;
	reg_t busfaultact	 : 1;
	reg_t				 : 1;
	reg_t usagefaultact	 : 1;
	reg_t				 : 3;
	reg_t svcallact		 : 1;
	reg_t monitoract	 : 1;
	reg_t				 : 1;
	reg_t pendsvact		 : 1;
	reg_t systickact	 : 1;
	reg_t usgfaultpended : 1;
	reg_t memfaultpended : 1;
	reg_t busfaultpended : 1;
	reg_t svcallpended	 : 1;
	reg_t memfaultena	 : 1;
	reg_t busfaultena	 : 1;
	reg_t usgfaultena	 : 1;
	reg_t				 : 13;
} SCB_SHCSR_t;
#define SCB_SHCSR 			((SCB_SHCSR_t*)0xE000ED24u)
#define SCB_SHCSR_RAW 		((reg_t*)0xE000ED24u)

typedef volatile struct {
	// memmanage fault status
	reg_t iaccviol	  : 1;
	reg_t daccviol	  : 1;
	reg_t			  : 1;
	reg_t munstkerr	  : 1;
	reg_t mstkerr	  : 1;
	reg_t mlsperr	  : 1;
	reg_t			  : 1;
	reg_t mmarvalid	  : 1;
	// bus fault status
	reg_t ibuserr	  : 1;
	reg_t preciserr	  : 1;
	reg_t impreciserr : 1;
	reg_t unstkerr	  : 1;
	reg_t stkerr	  : 1;
	reg_t lsperr	  : 1;
	reg_t			  : 1;
	reg_t bfarvalid	  : 1;
	// usage fault status
	reg_t undefinstr  : 1;
	reg_t invstate	  : 1;
	reg_t invpc		  : 1;
	reg_t nocp		  : 1;
	reg_t			  : 4;
	reg_t unaligned	  : 1;
	reg_t divbyzero	  : 1;
	reg_t			  : 6;
} SCB_CFSR_t;
#define SCB_CFSR 			((SCB_CFSR_t*)0xE000ED28u)
#define SCB_CFSR_RAW 		((reg_t*)0xE000ED28u)

typedef volatile struct {
	reg_t		   : 1;
	reg_t vecttbl  : 1;
	reg_t		   : 28;
	reg_t forced   : 1;
	reg_t debugevt : 1;
} SCB_HFSR_t;
#define SCB_HFSR 			((SCB_HFSR_t*)0xE000ED2Cu)
#define SCB_HFSR_RAW 		((reg_t*)0xE000ED2Cu)

typedef volatile struct {
	reg_t halted   : 1;
	reg_t bkpt	   : 1;
	reg_t dwttrap  : 1;
	reg_t vcatch   : 1;
	reg_t external : 1;
	reg_t		   : 27;
} SCB_DFSR_t;
#define SCB_DFSR 			((SCB_DFSR_t*)0xE000ED30u)
#define SCB_DFSR_RAW 		((reg_t*)0xE000ED30u)

typedef volatile struct {
	reg_t address : 32;
} SCB_MMFAR_t;
#define SCB_MMFAR 			((SCB_MMFAR_t*)0xE000ED34u)
#define SCB_MMFAR_RAW 		((reg_t*)0xE000ED34u)

typedef volatile struct {
	reg_t address : 32;
} SCB_BFAR_t;
#define SCB_BFAR 			((SCB_BFAR_t*)0xE000ED38u)
#define SCB_BFAR_RAW 		((reg_t*)0xE000ED38u)

typedef volatile struct {
	reg_t unknown : 32;	 // TODO: vendor defined
} SCB_AFSR_t;
#define SCB_AFSR 			((SCB_AFSR_t*)0xE000ED3Cu)
#define SCB_AFSR_RAW 		((reg_t*)0xE000ED3Cu)

// CPUID scheme registers

typedef volatile struct {
	reg_t state0 : 4;
	reg_t state1 : 4;
	reg_t state2 : 4;
	reg_t state3 : 4;
	reg_t		 : 16;
} SCB_ID_PFR0_t;
#define SCB_ID_PFR0 		((SCB_ID_PFR0_t*)0xE000ED40u)
#define SCB_ID_PFR0_RAW 	((reg_t*)0xE000ED40u)

typedef volatile struct {
	reg_t			 : 8;
	reg_t prog_model : 4;
	reg_t			 : 20;
} SCB_ID_PFR1_t;
#define SCB_ID_PFR1 		((SCB_ID_PFR1_t*)0xE000ED44u)
#define SCB_ID_PFR1_RAW 	((reg_t*)0xE000ED44u)

typedef volatile struct {
	reg_t			  : 20;
	reg_t debug_model : 4;
	reg_t			  : 8;
} SCB_ID_DFR0_t;
#define SCB_ID_DFR0 		((SCB_ID_DFR0_t*)0xE000ED48u)
#define SCB_ID_DFR0_RAW 	((reg_t*)0xE000ED48u)

typedef volatile struct {
	reg_t unknown : 32;	 // TODO: vendor defined
} SCB_ID_AFR0_t;
#define SCB_ID_AFR0 		((SCB_ID_AFR0_t*)0xE000ED4Cu)
#define SCB_ID_AFR0_RAW 	((reg_t*)0xE000ED4Cu)

typedef volatile struct {
	reg_t			   : 4;
	reg_t pmsa		   : 4;
	reg_t outer_share  : 4;
	reg_t share_levels : 4;
	reg_t tcm		   : 4;
	reg_t aux_regs	   : 4;
	reg_t			   : 8;
} SCB_ID_MMFR0_t;
#define SCB_ID_MMFR0 		((SCB_ID_MMFR0_t*)0xE000ED50u)
#define SCB_ID_MMFR0_RAW 	((reg_t*)0xE000ED50u)

typedef volatile struct {
	reg_t reserved : 32;
} SCB_ID_MMFR1_t;
#define SCB_ID_MMFR1 		((SCB_ID_MMFR1_t*)0xE000ED54u)
#define SCB_ID_MMFR1_RAW 	((reg_t*)0xE000ED54u)

typedef volatile struct {
	reg_t			: 24;
	reg_t wfi_stall : 4;
	reg_t			: 4;
} SCB_ID_MMFR2_t;
#define SCB_ID_MMFR2 		((SCB_ID_MMFR2_t*)0xE000ED58u)
#define SCB_ID_MMFR2_RAW 	((reg_t*)0xE000ED58u)

typedef volatile struct {
	reg_t reserved : 32;
} SCB_ID_MMFR3_t;
#define SCB_ID_MMFR3 		((SCB_ID_MMFR3_t*)0xE000ED5Cu)
#define SCB_ID_MMFR3_RAW 	((reg_t*)0xE000ED5Cu)

typedef volatile struct {
	reg_t				   : 4;
	reg_t bitcount_instrs  : 4;
	reg_t bitfield_instrs  : 4;
	reg_t cmpbranch_instrs : 4;
	reg_t coproc_instrs	   : 4;
	reg_t debug_instrs	   : 4;
	reg_t divide_instrs	   : 4;
	reg_t				   : 4;
} SCB_ID_ISAR0_t;
#define SCB_ID_ISAR0 		((SCB_ID_ISAR0_t*)0xE000ED60u)
#define SCB_ID_ISAR0_RAW 	((reg_t*)0xE000ED60u)

typedef volatile struct {
	reg_t				   : 12;
	reg_t extend_instrs	   : 4;
	reg_t ifthen_instrs	   : 4;
	reg_t immediate_instrs : 4;
	reg_t interwork_instrs : 4;
	reg_t				   : 4;
} SCB_ID_ISAR1_t;
#define SCB_ID_ISAR1 		((SCB_ID_ISAR1_t*)0xE000ED64u)
#define SCB_ID_ISAR1_RAW 	((reg_t*)0xE000ED64u)

typedef volatile struct {
	reg_t loadstore_instrs		: 4;
	reg_t memhint_instrs		: 4;
	reg_t multiaccessint_instrs : 4;
	reg_t mult_instrs			: 4;
	reg_t mults_instrs			: 4;
	reg_t multu_instrs			: 4;
	reg_t						: 4;
	reg_t reversal_instrs		: 4;
} SCB_ID_ISAR2_t;
#define SCB_ID_ISAR2 		((SCB_ID_ISAR2_t*)0xE000ED68u)
#define SCB_ID_ISAR2_RAW 	((reg_t*)0xE000ED68u)

typedef volatile struct {
	reg_t saturate_instrs  : 4;
	reg_t simd_instrs	   : 4;
	reg_t svc_instrs	   : 4;
	reg_t synchprim_instrs : 4;
	reg_t tabbranch_instrs : 4;
	reg_t thumbcopy_instrs : 4;
	reg_t truenop_instrs   : 4;
	reg_t				   : 4;
} SCB_ID_ISAR3_t;
#define SCB_ID_ISAR3 		((SCB_ID_ISAR3_t*)0xE000ED6Cu)
#define SCB_ID_ISAR3_RAW 	((reg_t*)0xE000ED6Cu)

typedef volatile struct {
	reg_t unpriv_instrs			: 4;
	reg_t withshifts_instrs		: 4;
	reg_t writeback_instrs		: 4;
	reg_t						: 4;
	reg_t barrier_instrs		: 4;
	reg_t synchprim_instrs_frac : 4;
	reg_t psr_m_instrs			: 4;
	reg_t						: 4;
} SCB_ID_ISAR4_t;
#define SCB_ID_ISAR4 		((SCB_ID_ISAR4_t*)0xE000ED70u)
#define SCB_ID_ISAR4_RAW 	((reg_t*)0xE000ED70u)

typedef volatile struct {
	reg_t reserved : 32;
} SCB_ID_ISAR5_t;
#define SCB_ID_ISAR5 		((SCB_ID_ISAR5_t*)0xE000ED74u)
#define SCB_ID_ISAR5_RAW 	((reg_t*)0xE000ED74u)

typedef volatile struct {
	reg_t ctype1 : 3;
	reg_t ctype2 : 3;
	reg_t ctype3 : 3;
	reg_t ctype4 : 3;
	reg_t ctype5 : 3;
	reg_t ctype6 : 3;
	reg_t ctype7 : 3;
	reg_t louis	 : 3;
	reg_t loc	 : 3;
	reg_t louu	 : 3;
	reg_t		 : 2;
} SCB_ID_CLIDR_t;
#define SCB_ID_CLIDR 		((SCB_ID_CLIDR_t*)0xE000ED78u)
#define SCB_ID_CLIDR_RAW 	((reg_t*)0xE000ED78u)

typedef volatile struct {
	reg_t linesize		: 3;
	reg_t associativity : 10;
	reg_t numsets		: 15;
	reg_t wa			: 1;
	reg_t ra			: 1;
	reg_t wb			: 1;
	reg_t wt			: 1;
} SCB_ID_CCSIDR_t;
#define SCB_ID_CCSIDR 		((SCB_ID_CCSIDR_t*)0xE000ED7Cu)
#define SCB_ID_CCSIDR_RAW 	((reg_t*)0xE000ED7Cu)

typedef volatile struct {
	reg_t ind	: 1;
	reg_t level : 3;
	reg_t		: 28;
} SCB_ID_CCSELR_t;
#define SCB_ID_CCSELR 		((SCB_ID_CCSELR_t*)0xE000ED80u)
#define SCB_ID_CCSELR_RAW 	((reg_t*)0xE000ED80u)

typedef volatile struct {
	reg_t iminline : 4;
	reg_t		   : 10;
	reg_t		   : 2;
	reg_t dminline : 4;
	reg_t erg	   : 4;
	reg_t cwg	   : 4;
	reg_t		   : 1;
	reg_t format   : 3;
} SCB_ID_CTR_t;
#define SCB_ID_CTR 			((SCB_ID_CTR_t*)0xE000ED84u)
#define SCB_ID_CTR_RAW 		((reg_t*)0xE000ED84u)

typedef volatile struct {
	reg_t cp0  : 2;
	reg_t cp1  : 2;
	reg_t cp2  : 2;
	reg_t cp3  : 2;
	reg_t cp4  : 2;
	reg_t cp5  : 2;
	reg_t cp6  : 2;
	reg_t cp7  : 2;
	reg_t	   : 4;
	reg_t cp10 : 2;
	reg_t cp11 : 2;
	reg_t	   : 8;
} SCB_CPACR_t;
